{"title": "White House Says Admiral Ordered Follow-on Strike on Alleged Drug Boat, Insists Attack Was Lawful", "publish_time": "20251201", "content": "WASHINGTON (AP) — The White House said Monday that a Navy admiral acted “within his authority and the law” when he ordered a second, follow-up strike on an alleged drug boat in the Caribbean Sea in a September U.S. military operation that has come under bipartisan scrutiny.\n\nWhite House press secretary Karoline Leavitt offered the justification for the Sept. 2 strike after lawmakers from both parties on Sunday announced support for congressional reviews of U.S. military strikes against vessels suspected of smuggling drugs in the Caribbean Sea and eastern Pacific Ocean, citing a published report that Defense Secretary Pete Hegseth issued a verbal order for a second strike that killed survivors on the boat in that incident.\n\nLeavitt in her comments to reporters on Monday did not dispute a Washington Post report that there were survivors after the initial strike in the incident. Her explanation came after President Donald Trump a day earlier said that he “wouldn’t have wanted that — not a second strike” when asked about the incident.\n\n“Secretary Hegseth authorized Admiral Bradley to conduct these kinetic strikes,” said Leavitt, referring to U.S. Navy Vice Admiral Frank Bradley, who at the time was the commander of Joint Special Operations Command. “Admiral Bradley worked well within his authority and the law, directing the engagement to ensure the boat was destroyed and the threat to the United States of America was eliminated.”\n\nThe lawmakers said they did not know whether last week’s Post report was true, and some Republicans were skeptical. Still, they said the reports of attacking survivors of an initial missile strike posed serious legal concerns and merited further scrutiny.\n\n\"This rises to the level of a war crime if it’s true,” said Sen. Tim Kaine, D-Va.\n\nRep. Mike Turner, R-Ohio, when asked about a follow-up strike aimed at people no longer able to fight, said Congress does not have information that happened. He noted that leaders of the Armed Services Committee in both the House and Senate have opened investigations.\n\n“Obviously, if that occurred, that would be very serious and I agree that that would be an illegal act,” Turner said.\n\nTrump on Sunday vigorously defended Hegseth.\n\n“Pete said he did not order the death of those two men,” Trump said. He added, “And I believe him.”\n\nLeavitt said Hegseth has spoken with members of Congress who may have expressed some concerns about the reports over the weekend.\n\nGen. Dan Caine, chairman of the Joint Chiefs of Staff, also spoke over the weekend with the four bipartisan lawmakers leading the Senate and House Armed Services Committees in which he reiterated “his trust and confidence in the experienced commanders at every echelon,” Caine's office said in a statement.\n\nThe statement added that the call focused on “addressing the intent and legality of missions to disrupt illicit trafficking networks which threaten the security and stability of the Western Hemisphere.\"\n\nAfter the Post’s report, Hegseth said Friday on X that “fake news is delivering more fabricated, inflammatory, and derogatory reporting to discredit our incredible warriors fighting to protect the homeland.”\n\n“Our current operations in the Caribbean are lawful under both U.S. and international law, with all actions in compliance with the law of armed conflict—and approved by the best military and civilian lawyers, up and down the chain of command,” Hegseth wrote.\n\nLeavitt also confirmed that Trump later on Monday would be holding a meeting with his national security team to discuss the ongoing operations in the Caribbean Sea and potential next steps against Venezuela.\n\nThe U.S. administration says the strikes in the Caribbean are aimed at drug cartels, some of which it claims are controlled by Venezuelan President Nicolás Maduro. Trump also is weighing whether to carry out strikes on the Venezuelan mainland.\n\nTrump on Sunday confirmed that he had recently spoken by phone with Maduro but declined to detail the conversation.\n\nThe September strike was one in a series carried out by the U.S. military in the Caribbean Sea and eastern Pacific Ocean as Trump has ordered the build up a fleet of warships near Venezuela, including the largest U.S. aircraft carrier.\n\nMore than 80 have been killed the strikes on small boats that the Trump administration alleges smuggle narcotics for drug cartels.\n\nVenezuela’s National Assembly has announced the launch of an investigation into the lethal strikes carried about by the U.S.\n\nSunday’s announcement by the Assembly’s president, Jorge Rodríguez, marked the first time that a Maduro government official explicitly acknowledged that Venezuelans have been killed in the monthslong U.S. military operation.\n\nRodríguez, Maduro’s chief negotiator, said a group of lawmakers will come together to investigate “the serious events that led to the murder of Venezuelans in the waters of the Caribbean Sea.”\n\n___\n\nAssociated Press writer Regina Garcia Cano in Caracas, Venezuela, and Konstantin Toropin contributed to this report.\n\n"}
{"title": "Schofield Soldiers Developing Drones for Pacific Operations", "publish_time": "20251201", "content": "Soldiers at the 25th Infantry Division’s “Lightning Lab ” at Schofield Barracks have been developing, building, tinkering with and modifying drones as technology that was once seen as science fiction becomes increasingly a fact of life in the 21st century.\n\nThe Lightning Lab is the division’s “innovation and development ” section, meant to look at how new technology can help support the division’s soldiers and leaders.\n\n“There are only soldiers here, we don’t have any civilians that work with us, so no ( Department of the Army ) civilians, no contractors, ” said Lt. Col. Nathan Whitney, the lab’s director. “There’s all soldier tech.”\n\nThe 25th Infantry Division, sometimes called “America’s Pacific Division, ” is increasingly finding itself central to Army planning as it seeks to plan and reshape its forces for the possibility of a conflict with China in the Pacific region.\n\nBoth Chinese and American leaders have closely watched the war in Ukraine and the new tactics and tech that have come out of the conflict. The rapid proliferation of drones in battle by both sides of the conflict has garnered particular interest.\n\n“We started off at the beginning of this year, we were given a task to build some drones, ” Whitney said.\n\nThe 25th has deployed across the region, notably to the Philippines, as it finds itself in an increasingly bitter dispute with Beijing over territorial and navigation in waters claimed by Manila. This year, as troops from the division prepared for the annual back-to-back Salaknib and Balikatan exercises in the Philippines in the spring, they knew that drones were going to play a particularly big role.\n\nAt the Lightning Lab, soldiers tested several models they built on the spot. Chief Warrant Officer 2 John Crutcher said that “from the manufacturing and assembly side of the house, we showed up with zero knowledge.”\n\nWhen asked where the training to do it came from, Crutcher deadpanned “YouTube University, Google University, Reddit University—I’m a graduate of all three.”\n\nThe soldiers tested several designs. Among them was one they called the “Kestrel, ” named for the small bird of prey. They use the small, simple machines as “kamikaze ” drones making a one-way trip toward their targets, carrying an explosive and detonating as an operator controls it from afar.\n\n“About four days before we left for the Philippines, we fleshed out which frame we were going to use, ” Crutcher said. “We went out to the Philippines, made 125 of them out there in the field, and took a lot of good feedback from the field, and with that feedback … about a week after we got back from the Philippines, we made this model we’re calling the ‘Falconet.’”\n\nThe use of small, armed drones has become increasingly ubiquitous on battlefields around the world, from Islamic State militants in Iraq and Syria attacking government forces to Mexican drug cartels using them against their rivals and law enforcement.\n\nIn Ukraine, they have changed the game as relatively cheap drones have been used to destroy multi-million dollar tanks and other equipment. Ukrainian forces also have used drones to attack Russian targets deep behind enemy lines.\n\nCrutcher said of the Kestrel that “it’s a very simple system. It’s about $12 in components, including the plastic to print the stuff.”\n\nThe rapid development of drones, and their increasing use across commercial and government sectors, means they’re no longer as specialized as they once were. Crutcher had been a drone operator before coming to Lightning Lab, with much of his career focused on larger drones like the infamous Predator and Reaper drones that have prowled the skies during America’s post 9 /11 wars doing targeted killings across the Middle East.\n\nSoldiers at the 25th infantry division say that as drones become a more common sight on the battlefield—and as they increasingly become built, modified and used to deadly effect on the front lines—every soldier needs to understand them. Drone hobbyists are now being encouraged to test and share skills and tricks.\n\nLt. Col. Eugene Miranda, a 25th Infantry Division spokesman said that “a lot of that innovation is being powered down to the soldiers who are actually the users of the things. So we get that real-time feedback versus these age-old systems where it’s optimized only for the process of the planning, programming, budgeting and execution time horizon that just outpaces the pace of relevance.”\n\nThe 25th Infantry Division has been working to train soldiers well beyond the Lightning Lab to understand how drones work and how to use them, including courses on how to build and fix them.\n\n“Part of the course is actually coming in for a couple hours and putting your hands on and basic soldering, ” explained Crutcher. “Because the idea is that we don’t want to be the single point of failure for the 25th ID. You can’t rely on a 13-­person shop to mass manufacture at scale, right ? Anybody who knows how to do math is going to be able to figure that out pretty quickly.”\n\nThe Lightning Lab also has been looking out across Hawaii for ways to partner on getting parts and utilizing new technology, having been in talks with University of Hawaii and companies that soldiers have interacted with at conferences and trade shows.\n\nBoth military and Hawaii state leaders have been pushing for more manufacturing and 3D printing in Hawaii.\n\nHonolulu Community College on Aug. 6 unveiled a new Advanced Manufacturing Program Facility. The new training center is part of an umbrella of programs funded by the U.S. military to seed education and training programs in Hawaii for highly skilled industrial roles and train people how to use advanced new tools and techniques. The new facility has $12 million worth of machines funded by the Office of Secretary of Defense’s Industrial Base Analysis and Sustainment program.\n\n“We need certain pieces of equipment and resources that we have a budget for, ” said Chief Warrant Officer 3 Aaron Dunson, Lightning Lab’s operations officer. They are looking for ways to partner with local Hawaii companies and “basically stimulate the economy as the nation needs to bring back drone manufacturing to the U.S. whereas China owns the market with DJI.”\n\nDJI is the acronym for Da-Jiang Innovations, a company based in Shenzen, China, that has dominated drone production.\n\nAs of 2024 it accounted for over 90 % of the world’s consumer drone market, being used for everything from photography and surveillance, as well as for spraying pesticides and carrying packages and mail. DJI products also have have been used around the world by police forces, militaries and terrorist groups—though the company said it seeks to crack down on the latter.\n\nU.S. officials have said there is some evidence that the Chinese government may sometimes be able to tap into the camera feeds of Chinese-made drones or remotely disable some components at critical times. Contractors seeking to build drones for the U.S. military market themselves as making “blue force ” drones—those without Chinese components, chips or software.\n\n© 2025 The Honolulu Star-Advertiser. Visit www.staradvertiser.com. Distributed by Tribune Content Agency, LLC.\n\n"}
{"title": "CENTCOM Unveils Middle East Drone Task Force Boosted by Pentagon", "publish_time": "20251203", "content": "U.S. Central Command (CENTCOM) on Wednesday announced a new task force for the U.S. military’s first one-way-attack drone squadron based in the Middle East, as part of the Defense Department’s wide-ranging push to accelerate domestic drone acquisition and implementation.\n\nThe launch of the Task Force Scorpion Strike (TFSS) is designed to attain low-cost and effective drones and field them to warfighters, following Defense Secretary Pete Hegseth’s directive earlier this year to boost affordable drone technology. A squadron of Low-cost Unmanned Combat Attack System (LUCAS) drones are already based in the Middle East.\n\n“This new task force sets the conditions for using innovation as a deterrent,” Adm. Brad Cooper, CENTCOM commander, said in a statement. “Equipping our skilled warfighters faster with cutting-edge drone capabilities showcases U.S. military innovation and strength, which deters bad actors.”\n\nA CENTCOM spokesperson referred Military.com to their press release. Military.com reached out to the Pentagon for comment.\n\nCENTCOM-deployed LUCAS drones are designed to operate anonymously and can be launched by multiple mechanisms including catapults, rocket-assisted takeoff, and mobile ground and vehicle systems. They are designed to operate autonomously and cost roughly $35,000 per platform.\n\nIn June, Hegseth was present when 18 American-made drone prototypes were on display at the Pentagon. The LUCAS kamikaze drones are designed to be a cheaper but formidable alternative to Iran’s Shahed-136 drones.\n\nToday’s announcement comes more than two months after CENTCOM announced the Rapid Employment Joint Task Force (REJTF), led by CENTCOM’s chief technology officer to fast-track processes for outfitting deployed forces with cutting-edge capabilities.\n\nU.S. Special Operations Command Central (SOCCENT) oversees TFSS.\n\nThe CENTCOM announcement comes one day after Hegseth and the Defense Department outlined their long-term “Drone Dominance” program that will purchase hundreds of thousands of drones in the next few years to boost American military superiority.\n\nThe plan will begin early next year and take place over four phases or “gauntlets,” per Hegseth, with the federal government offering $1 billion to build roughly 340,000 small unmanned aerial systems capable of conducting one-way attack missions.\n\nHe said the first of those four gauntlets runs from February-July 2026 when 12 vendors will be asked to collectively produce 30,000 drones at a cost of $5,000 per unit, totaling $150 million in department outlays.\n\nThe number of drones ordered will increase from 30,000 to 150,000, and the price per drone will drop from $5,000 to $2,300, over the course of the remaining three gauntlets that will see vendor numbers decrease from 12 to five.\n\n\"I will soon be meeting with the military services to discuss transformational changes in warfighting doctrine,\" Hegseth said Tuesday. \"We need to outfit our combat units with unmanned systems at scale. We cannot wait. The funding provided by the Big Beautiful Bill is ready to be used to mount an effective sprint to build combat power.\n\n“At the Department of War, we are adopting new technologies with a 'fight tonight' philosophy—so that our warfighters have the cutting-edge tools they need to prevail.\"\n\nIn June, President Donald Trump signed an executive order, \"Unleashing American Drone Dominance,” intended to invigorate the commercial and military drone sectors by making inexpensive and American-made drones that can be equipped by military units across the globe.\n\nHegseth followed Trump’s executive order with his own memorandum in July, saying his department “is going above and beyond” the directive by rescinding what he described as restrictive policies that hinder production and limit access to vital technologies.\n\nHis outlined memorandum included three major sticking points: leveraging private capital flows that boost the U.S. drone manufacturing industry; powering a “technological leapfrog” that gives the U.S. an edge in a new era of warfare; and “overcoming the bureaucracy's instinctive risk-aversion” on budgeting, weaponization and training to simulate battlefield scenarios at the ready.\n\n\"Lethality will not be hindered by self-imposed restrictions, especially when it comes to harnessing technologies we invented but were slow to pursue,\" Hegseth said in July. \"Drone technology is advancing so rapidly, our major risk is risk-avoidance. The Department's bureaucratic gloves are coming off.\"\n\n"}
{"title": "Uranium Added to US Critical Minerals List: What It Means for National Security, AI", "publish_time": "20251128", "content": "The addition of uranium to the United States’ critical minerals list could have wide-ranging economic and national security implications.\n\nOn Nov. 6 the Department of the Interior, through the U.S. Geological Survey (USGS), published the final 2025 list of critical minerals that the government says are vital to negate potential risks from disrupted supply chains. It’s the third published list President Donald Trump issued an executive order in 2017, during his first term, directing federal agencies to strengthen mineral security.\n\nA total of 10 new minerals were added to the list, bringing the total number to 60: boron, copper, lead, metallurgical coal, phosphate, potash, rhenium, silicon, silver, and uranium. The total list also includes 15 rare earth elements.\n\nA full list of all minerals can be viewed below.\n\n“This is the most comprehensive, science-based assessment yet of the minerals our nation relies on,” USGS Director Ned Mamula said in a statement. “Critical minerals underpin industries worth trillions of dollars, and import dependence puts key sectors at risk. This work helps secure the materials needed for U.S. economic growth and technological leadership.”\n\nMilitary.com reached out to USGS for additional comment.\n\nThe list must be reviewed every three years according to the Energy Act of 2020 signed by Trump, with USGS saying “the list is not static” and will be updated at least every two years “to reflect evolving circumstances.”\n\nTrump has called for a quadrupling of nuclear power by 2050.\n\nChristo Liebenberg, co-founder and president of US-based uranium enrichment company LIS Technologies, told Military.com that there is “huge market demand” for uranium to boost a domestic electricity grid facing challenges from growing AI data centers in different pockets of the country.\n\nThe fact that the critical list now includes 60 minerals—more than half of the 118 elements on the periodic table—also stood out, he added.\n\n“Being on that list, it's clear that it triggers a whole set of advantages,” Liebenberg said. “That makes mining uranium in the U.S. a lot easier, faster and more attractive to investors.\n\n“It's like flipping a switch that says, ‘OK, everybody, uranium is now important. Let's make mining in the US easier, cheaper, faster and more predictable.’ Of course, this is exactly what would stimulate production. But the thing is, it doesn't stop just with mining. Being on that list actually has a ripple effect through the entire nuclear fuel supply chain.”\n\nThe fact that the critical list now includes 60 minerals—more than half of the 118 elements on the periodic table—also stood out, he added.\n\nRare elements’ inclusion on the list reflects upon the potential cost to the U.S. economy should supply chains become unraveled, notes USGS. They power ubiquitous technologies including smartphones, hard drives, and advanced defense systems.\n\nWhile the U.S. in 2024 imported 80% of the rare earth elements it used, different steps are now being taken to bolster acquisition. The U.S. is now investing in its own production and securing access through partners in Australia, Japan, Malaysia and Thailand.\n\nUSGS said it is mapping new domestic deposits and advancing scientific understanding of how geology influences their quality, size, and viability for extraction.\n\nBringing uranium back to the home front would be a decades-old course correction of sorts.\n\nLiebenberg said the U.S. was the biggest exporter of nuclear fuel in the 1960s, 1970s and 1980s, making its own rich uranium and building nuclear plants.\n\nBut following the Cold War and the end of the Soviet Union, Russia—a huge enricher of uranium for their nuclear weapons warheads—became a producer on the world market. That included selling uranium to the United States, which has imported uranium from Russia dating back to the 1990s.\n\n“We've become dependent on Russian nuclear fuel,” Liebenberg said. “This has decimated our industry in the U.S. to the point that we have no more uranium mines, we have no mission capability except for one plant in New Mexico. We have just one conversion facility [Honeywell Specialty Chemicals] in Metropolis, Illinois.”\n\nA sea change of sorts has come in part due to the Russia-Ukraine war and the U.S. wanting to wean off Russian assets like imported uranium. Some of the world’s biggest players and companies are focusing on the future.\n\n“The demand has skyrocketed not just because of the need for more power and more energy, but also the power consumption of AI data centers is just humongous and just keeps increasing and increasing,” Liebenberg said. “The U.S. soon is going to start having blackouts.\n\n\"Data centers are consuming so much power that we just cannot keep up. … These big tech companies, the big five tech companies, they want clean power and they need 24/7 power. Wind and solar is not going to cut it.\"\n\n"}
{"title": "Americans and AI: Nuclear Agency Follows Through on Trump’s ‘Genesis Mission’", "publish_time": "20251202", "content": "The National Nuclear Security Administration (NNSA) is following through on President Donald Trump’s directive to strengthen national security by rapidly advancing artificial intelligence through the recently approved Genesis Mission. Not all Americans are openly embracing rapid AI implementation.\n\nThe Genesis Mission, launched Nov. 24 through executive order, is another step in the administration’s broader push for U.S. global technology dominance predicated on aggressively pushing scientific discovery and economic growth via AI‑accelerated innovation. The Trump administration said the urgency will “require a historic national effort, comparable in urgency and ambition to the Manhattan Project” that produced the world’s first nuclear weapons during World War II.\n\nThe NNSA, a semi-autonomous agency within the U.S. Department of Energy that dates back to the Atomic Energy Act of 1946, has issued a Request for Information (RFI) titled \"Transformational AI Capabilities for National Security.\" The RFI is being used to execute national and international goals by means including accelerating nuclear weapons development timelines and enhancing nuclear nonproliferation efforts around the globe.\n\nOfficials say the RFI will receive input from a broad spectrum of innovators that include cutting-edge AI model developers, cloud environment providers, think tanks, universities and others with an end goal “to foster long-term collaborations to integrate transformative AI capabilities into NNSA’s critical operations.”\n\n“NNSA is at the forefront of leveraging cutting-edge technology to safeguard our nation,” NNSA Administrator Brandon Williams said in a statement. “President Trump’s Genesis Mission provides a clear mandate, and we are responding with immediate action. This RFI is a critical step in harnessing the immense power of AI to enact the White House’s vision for America to lead in every aspect of AI.”\n\nThe Genesis Mission, according to Trump’s executive order, will involve building an integrated AI platform that uses the world’s largest collection of federal datasets “to train scientific foundation models and create AI agents to test new hypotheses, automate research workflows, and accelerate scientific breakthroughs.”\n\nThose involved in seeing this mission through include American scientists, such as those at national laboratories, along with American businesses, world-renowned universities, and existing research infrastructure, data repositories, production plants and national security sites.\n\nU.S. Energy Secretary Chris Wright will oversee the mission, with aid and guidance from an Assistant to the President for Science and Technology (APST). Both will also collaborate with the Special Advisor for AI & Crypto to find innovators in academia and the private sector.\n\nInvigorating the AI sector has already been a major priority for the Trump administration throughout the first nearly 11 months of the president’s second term. In January, Trump signed an executive order reversing Biden-era AI policies.\n\nThat was followed by another executive order signed in April to use AI to advance K-12 education, as part of a broader initiative dubbed the “Presidential AI Challenge” that “seeks to inspire young people and educators to create AI-based innovative solutions to community challenges while fostering AI interest and competency.”\n\nThat includes early training in responsible AI use and tools that the White House says will “prepare America’s students to be confident participants in the AI-assisted workforce, propelling our Nation to new heights of scientific innovation and economic achievement.”\n\n“Students and educators of all backgrounds and expertise are encouraged to participate and ignite a new spirit of innovation as we celebrate 250 years of independence and look forward to the next 250 years,” the federal website says.\n\nIn July, Trump signed another executive order to prevent “woke AI” in the federal government. It preceded yet another AI-related executive order in September, calling to harness data from the Childhood Cancer Data Initiative to find cures for pediatric cancer.\n\nThe Trump administration has admitted that these myriad AI initiatives along with the latest Genesis Mission will require “large amounts of organized and high-quality data and significant computing power.”\n\n“With the Genesis Mission, the Trump Administration is bringing the power of AI to bear on our already expansive data infrastructure and creating a platform for multiple Federal research agencies and the private sector to collaborate to achieve breakthroughs currently thought impossible, and to win and stay ahead in the AI race,” a White House fact sheet states.\n\nBut not everyone is on board with the broader and seemingly swift implementation of AI on a national or even global scale. That includes portions of Trump’s own voters and supporters.\n\nResidents in states including Oregon, Pennsylvania, Tennessee and Texas have made headlines for either trying to block or delay AI data center projects in their communities.\n\nEarlier this year, Data Center Watch released a report covering the period between May 2024 and March 2025—finding that $64 billion in U.S. data center projects had been blocked or delayed by local opposition. They have built a database that examines where pushback is taking place and how the issue is taking hold in government filings, local media, petitions, social media and statements from public officials.\n\n$64 billion in U.S. data center projects had been blocked or delayed by local opposition. There are a minimum of 142 activist groups across 24 states that continue to organize.\n\nData Center Watch reports that within the last two years alone, about $18 billion worth of data center projects were blocked while another $46 billion of projects were delayed due to local opposition. There are a minimum of 142 activist groups across 24 states that continue to organize to block data center construction and expansion.\n\nOne of the most recent shows of opposition occurred in Dansville, Pennsylvania, where residents within a county of 18,000 people questioned officials about company Talen Energy aspiring to open a data center that locals fear will increase their utility bills, reduce working farmland, and strain local water and natural resources, according to Reuters.\n\n“Stay out,” said Craig High, 39, a Trump supporter, according to Reuters. “We wouldn’t even be having this conversation without federal involvement. Both (political) parties are pushing data centers and giving regulatory relief—water permits, permitting, all of it.”\n\nPolls show consternation of behalf of the majority of Americans.\n\nA survey from the Pew Research Center published in September found that more Americans are pessimistic than optimistic about the role of AI in society, including 53% saying AI will worsen people’s ability to think creatively while another 50% said it would negatively hinder the ability to form meaningful relationships.\n\nThe 50% of respondents who now say they’re more concerned than excited about the increased use of AI in daily life is up 13% in a few short years, up from 37% in 2021.\n\nEven for the Americans that are on board with AI, disagreements exist on how policies should be legislated and executed.\n\nAbout 75% of Americans, including 76% of registered Republicans and 72% of registered Democrats, want a single national AI policy rather than state and local officials applying AI-related security standards, according to a TechNet/Morning Consult survey of 1,978 registered voters that took place between Nov. 22-24.\n\nAnother roughly 70% of respondents said they were concerned that other countries are moving faster on AI than the United States, potentially threatening America’s long-term global security.\n\nRoughly 70% of respondents said they were concerned that other countries are moving faster on AI than the United States.\n\n“In 2025, over 1,000 AI bills have been introduced in state legislatures – many containing overlapping and contradictory rules and requirements,” said TechNet CEO Linda Moore in a statement. “Americans continue to want a single national policy so that we can secure America’s global leadership in technology, mitigate any potential risks, and maximize the benefits of AI for generations to come.”\n\nA Gallup survey in September found that 80% of U.S. adults believe the government should maintain rules for AI safety and data security, even at the behest of slower implementation of AI capabilities.\n\nGeneral trust issues remain. That survey found that just 2% of U.S. adults “fully” trust AI’s capability to make fair and unbiased decisions, while 29% trust it “somewhat.” But distrust in AI was reported by roughly six-in-10 respondents, with numbers slightly improving among AI users.\n\n"}
{"title": "Land and Security Are the Main Sticking Points as Russia and Ukraine Mull Trump's Peace Proposal", "publish_time": "20251201", "content": "Diplomats face an uphill battle to reconcile Russian and Ukrainian “red lines” as a renewed U.S.-led push to end the war gathers steam, with Ukrainian officials attending talks in the U.S. over the weekend and Washington officials expected in Moscow early this week.\n\nU.S. President Donald Trump's peace plan became public last month, sparking alarm that it was too favorable to Moscow. It was revised following talks in Geneva between the U.S. and Ukraine a week ago.\n\nUkraine’s President Volodymyr Zelenskyy has said the revised plan could be “workable.” Russian President Vladimir Putin called it a possible “basis” for a future peace agreement. Trump said Sunday “there’s a good chance we can make a deal.”\n\nStill, officials on both sides indicated a long road ahead as key sticking points — over whether Kyiv should cede land to Moscow and how to ensure Ukraine's future security — appear unresolved.\n\nHere is where things stand and what to expect this week:\n\nTrump representatives met the Ukrainian officials over the weekend and plan to meet with the Russians in coming days.\n\nUkraine’s national security council head Rustem Umerov, the head of Ukraine’s armed forces Andrii Hnatov, presidential adviser Oleksandr Bevz and others met with U.S. officials for about four hours on Sunday. U.S. Secretary of State Marco Rubio said the session was productive but more work remains. Umerov praised the U.S. for its support but offered no details.\n\nZelenskyy’s former chief of staff and former lead negotiator for Ukraine, Andrii Yermak, resigned Friday amid a corruption scandal and is no longer part of the negotiating team. It was only a week ago that Rubio met with Yermak in Geneva, resulting in a revised peace plan.\n\nTrump said last week that he would send his envoy Steve Witkoff to Russia. Kremlin spokesman Dmitry Peskov confirmed Monday that Putin will meet Witkoff on Tuesday afternoon.\n\nTrump suggested he could eventually meet with Putin and Zelenskyy, but not until there has been more progress.\n\nWitkoff’s role in the peace efforts came under scrutiny last week following a report that he coached Yuri Ushakov, Putin's foreign affairs adviser, on how Russia’s leader should pitch Trump on the Ukraine peace plan. Both Moscow and Washington downplayed the significance of the revelations.\n\nEager to please Trump, Kyiv and Moscow have ostensibly welcomed the peace plan and the push to end the war. But Russia has continued attacking Ukraine and reiterated its maximalist demands, indicating a deal is still a ways off.\n\nPutin implied last week that he will fight as a long as it takes to achieve his goals, saying that he will stop only when Ukrainian troops withdraw from all four Ukrainian regions that Russia illegally annexed in 2022 and still doesn’t fully control. “If they don’t withdraw, we’ll achieve this by force. That’s all,” he said.\n\nThe plan, Putin said, “could form the basis for future agreements,” but it is in no way final and requires “a serious discussion.”\n\nZelenskyy has refrained from talking about individual points, opting instead to thank Trump profusely for his efforts and emphasizing the need for Europe – whose interests are more closely aligned with Ukraine's – to be involved. He also has stressed the importance of robust security guarantees for Ukraine.\n\nThe first version of the plan granted some core Russian demands that Ukraine considers nonstarters, such as ceding land to Moscow that it doesn’t yet occupy and renouncing its bid to become a member of NATO.\n\nZelenskyy has said repeatedly that giving up territory is not an option. One of the Ukrainian negotiators, Bevz, told The Associated Press on Tuesday that Ukraine’s president wanted to discuss the territory issue with Trump directly. Yermak then told The Atlantic in an interview on Thursday that Zelenskyy would not sign over the land.\n\nZelenskyy also maintains that NATO membership is the cheapest way to guarantee Ukraine’s security, and NATO’s 32 member countries said last year that Ukraine is on an “irreversible” path to membership. Since he took office, Trump has made it clear that NATO membership is off the table.\n\nMoscow, in turn, has bristled at any suggestion of a Western peacekeeping force on the ground in Ukraine, and stressed that keeping Ukraine out of NATO and NATO out of Ukraine was one of the core goals of the war.\n\nZelenskyy, meanwhile, has been under pressure at home.\n\nYermak’s resignation was a major blow for Zelenskyy, although neither the president nor Yermak have been accused of wrongdoing by investigators.\n\n“Russia really wants Ukraine to make mistakes. There won’t be mistakes on our side,\" Zelenskyy said. \"Our work continues, our struggle continues. We don’t have a right not to push it to the end.”\n\nAn activist with Ukraine's nongovernmental Anti-Corruption Center, Valeriia Radchenko, said letting go of Yermak was the right decision and would open a “window of opportunity for reform.”\n\nPutin, meanwhile, seeks to project confidence, boasting of Russia’s advances on the battlefield.\n\nThe Russian leader “feels more confident than ever about the battlefield situation and is convinced that he can wait until Kyiv finally accepts that it cannot win and must negotiate on Russia’s well-known terms,” Tatiana Stanovaya of the Carnegie Russia and Eurasia Center wrote on X. “If the Americans can help move things in that direction — fine. If not, he knows how to proceed anyway. That is the current Kremlin logic.”\n\nNATO and the EU are holding several meetings this week focused on Ukraine.\n\nZelenskyy is holding talks with French President Emmanuel Macro n in Paris on Monday. In Brussels, NATO Secretary-General Mark Rutte is hosting Ukrainian Defense Minister Denys Shmyhal and EU defense and foreign ministers are gathering to discuss European military support for Ukraine and Europe’s defense readiness.\n\nOn Wednesday, NATO foreign ministers will gather again in Brussels.\n\nThe main issue for the EU right now is what to do with the frozen Russian assets in Belgium that the Trump peace plan in its initial version sought to use for post-war investment in Ukraine.\n\nThose funds are central to European Commission President Ursula von der Leyen’s strategy to ensure continued help for Ukraine while also maintaining pressure on Russia. But Belgium’s prime minister is holding out, worried about the legal implications of tapping the frozen assets for Ukraine, the impact that could have on the euro — and of Russian retaliation.\n\nThe diplomacy set in motion by Trump's peace plan “painfully exposed” Europe's weakness, Nigel Gould-Davies of the International Institute for Strategic Studies wrote in a recent commentary.\n\n“Despite being the main source of Ukraine’s economic and military support, it is marginal to the diplomacy of the war and has done little more than offer amendments to America’s draft peace plan,” Gould-Davies wrote.\n\n"}
{"title": "How Trump, Rubio and Others Are Using Social Media to Sell Venezuela Actions", "publish_time": "20251201", "content": "In the early months of President Donald Trump’s second term, administration officials turned to social media to describe an “invasion” of the United States by Venezuelan gangs. They used it to justify their efforts to deport thousands who had fled Nicolás Maduro’s regime.\n\nHomeland Security Secretary Kristi Noem, for instance, posted about ending Venezuelans’ temporary protected status, saying the Biden-era policy allowed Venezuelans to illegally enter the country and violate U.S. laws.\n\nA few months later, the story shifted.\n\nPosts by Trump, Secretary of State Marco Rubio and other officials started to depict Maduro himself as the head of a drug cartel and link him to fentanyl deaths in the U.S., though there is scant evidence that the country is involved in large-scale production or distribution of the synthetic opioid. Their posts portray the Maduro regime as an international security threat.\n\nU.S. officials’ messaging about the country this year has dovetailed with the administration’s shifting policy priorities, a Miami Herald review of more than 56,000 posts on X (formerly, Twitter) from three dozen accounts show. And their posts have become more negative and angrier with time.\n\nThe U.S. meanwhile has blown up dozens of boats and killed scores of people it alleges were drug-traffickers in the Southern Caribbean. And U.S. warships and planes now stand poised to conduct military strikes inside Venezuela.\n\nOne of Trump’s key promises on the campaign trail was that the U.S. will no longer fight wars abroad. Projecting the current military buildup in the Caribbean as part of the “war on drugs” potentially allows the U.S. to portray the lethal strikes as a policing action rather than an intervention in the affairs of another country.\n\nThe amped up rhetoric in U.S. officials’ social media posts are a way to “prepare the ground” for the possibility of a military strike on Venezuela, said Christopher Hernandez-Roy, an expert on the region with the Center for Strategic and International Studies.\n\nThe White House and the State Department did not answer specific questions from the Herald about the administration’s public messaging, the military deployment or how the standoff could end.\n\nAnna Kelly, a spokesperson, said that all the strikes were against “designated narcoterrorists bringing deadly poison to our shores.”\n\n“The President will continue to use every element of American power to stop drugs from flooding into our country and to bring those responsible to justice,” she said.\n\nSince his appointment as Secretary of State, Rubio began linking Maduro to drug trafficking in social media posts for the first time only on July 27.\n\nThe next day Attorney General Pam Bondi announced a $50 million reward for Maduro’s arrest on narcoterrorism charges and a few days later, the State Department posted a video where Rubio declared that the United States does not “recognize that [the Venezuelan] government is legitimate.”\n\nRubio described Maduro as the “head of the vicious Cartel de Los Soles” in a post on the night of August 8. Two weeks later, the first U.S. Navy warships ⁠steamed into the Southern Caribbean.\n\nSince the three Aegis-guided missile destroyers first arrived off the coast of Venezuela in late-August, surveillance airplanes from the U.S. Naval Airbase in Jacksonville, Fla. have flown sortees in the region, bombers have circled off Venezuela’s maritime borders and thousands of U.S. ground troops are deployed in the roughly dozen ships now in the area.\n\nU.S. fighter jets, drones and gunships have carried out lethal strikes killing at least 86 pub individuals.\n\nThe U.S.S. Gerald R. Ford, the world’s largest aircraft carrier, arrived in the Caribbean on Nov. 16.\n\nThe military is also upgrading the runways at Roosevelt Roads, a previously abandoned naval base in Puerto Rico, satellite photos obtained by the Herald shows. The upgrades would enable fighter jets and cargo planes to use the base. The renovations indicate that the U.S. is looking to maintain a sustained and long-term aggressive posture in the region, military experts told the Herald.\n\n“This is a use of hard power to provoke a change,” said Hernandez-Roy. “The administration is trying to scare the pants off of Venezuela.”\n\nMaduro, for his part, has mobilized millions of Venezuelans in the Bolivarian militia ⁠— a reserve force ⁠created by the late President Hugo Chávez — to support the country’s military in the event of an attack from the United States. He warned last week that attacking the country would end Trump’s political career.\n\nQuestions abound about the administration’s broad assertions regarding Venezuela on social media and elsewhere.\n\nEarlier this year, criminologists and experts on the region questioned the Trump administration’s claims about Tren de Aragua members being controlled by the Maduro regime and flooding into the United States. More recently critics have again questioned U.S. officials’ assertions that the boats it has blown up in the Caribbean were carrying drugs and also the broader claim that Venezuela is a major player in fentanyl trafficking.\n\nWhile Trump posted about combating fentanyl trafficking when the strikes first began in September, recent posts by him and other administration officials and agency social media accounts have been vaguer only using broad words like “drugs” and “narcotics”, without specifying a type, the Herald found.\n\nThe administration is yet to produce any evidence to the public that the individuals it has killed are drug-traffickers, leading to concerns both in Congress and among U.S. allies that the lethal strikes may be illegal.\n\nOpen opposition to the Venezuelan regime has long been a focus of both Trump and Rubio.\n\nThe U.S. Justice Department under the first Trump administration indicted Venezuelan President Nicolás Maduro for allegedly collaborating with the left-wing guerrilla group, Revolutionary Armed Forces of Colombia and “flooding” the United States with cocaine in early-2020. Federal prosecutors also argued that Maduro had grown to become leader of the Cartel de Los Soles ⁠— “Cartel of the Suns” ⁠— an informal organized crime syndicate that is generally believed to be headed by high-ranking members of the Venezuelan military.\n\nU.S. officials last year questioned the integrity of Venezuela’s elections last year after Maduro declared victory. They noted that tally sheets obtained from local polling stations by the opposition and independent observers show a different outcome than that announced by the country’s election administrators.\n\nBut the remarkable military buildup in the Southern Caribbean ⁠— around a tenth of the American global fleet is now deployed in the area ⁠— marks a new phase in tensions between Washington and Caracas.\n\nThe escalation of tensions has gone hand-in-hand with public messaging about Venezuela from U.S. government officials and agencies, the Herald found.\n\nThe frequency with which officials and social media accounts of government agencies have posted about how Venezuela and the Maduro regime is a foreign and military problem have dramatically increased leading up to and since the military deployment.\n\nSocial media is a better medium for political figures to get their ideas across since it removes any moderation or interference with their messages like the fact-checks a traditional news outlet may provide, said Pinal Yildrim. Yildrim is a University of Pennsylvania professor who studies political messaging and social media.\n\nSince social media is already based on followers with common interests, officials or lawmakers posting about a policy automatically get amplified by their base.\n\n“In some ways it is like preaching to a choir,” said Yildirim but warned against over-generalizing about any trends since every situation or social media user is different.\n\nThe recent posts on the Maduro regime and the military strikes, the Herald found, have received nearly 1.5 million views on average ⁠— five times more than posts which position the influx of undocumented Venezuelan immigrants as a domestic issue.\n\nThe nearly two dozen lethal strikes in the Caribbean so far have proven controversial with even long-time U.S. allies like the United Kingdom, which has reportedly paused intelligence sharing out of concern that the military actions may be illegal.\n\nSome prominent figures in the Venezuelan community in South Florida urged caution but all told the Herald that they saw the U.S. military presence as an “element of hope” that may bring about the fall of the Maduro regime.\n\nMaria Corina Machado, Venezuela’s top opposition leader and winner of this year’s Nobel Peace Prize, called Trump’s strategy “absolutely correct” at the America Business Forum in Miami earlier this month.\n\nEchoing U.S. officials, she called Maduro “head of a narco-terror structure” and said Trump is working to disrupt the “drug trafficking, gold smuggling, arms and human trafficking” networks in the region.\n\n“Maduro started this war,” she said. “President Trump is ending it.”\n\nMiami Herald staff writer Antonio Delgado contributed reporting.\n\nThe Miami Herald analyzed more than 57,000 posts on X, formerly known as Twitter, made by government officials since January, 2025. The Herald obtained the data from the Algorithmic Transparency Institute, a project of the National Conference on Citizenship, a nonpartisan U.S. Congressionally chartered nonprofit.\n\nThe Herald then parsed the posts nd identified those that were related to Venezuela, Nicolas Maduro’s regime, narcotics-trafficking in the Caribbean or the lethal strikes in the area. All re-posts and quoted posts were excluded from the analysis. .\n\nTo measure the sentiments expressed in the posts, the Herald deployed a machine-learning algorithm using the open-source NRC Emotion Lexicon developed by researchers at the National Research Council in Canada.\n\nThe Herald also manually checked a sample of the dataset to verify that all automated tasks were completed accurately. To select the sample size, the Herald used Fisher’s formula. All Venezuela-related posts were manually reviewed and classified as related to domestic or foreign and military affairs.\n\nThe posts analyzed by the Herald include the personal and official accounts of Vice President J.D. Vance, Secretary of State Marco Rubio, Secretary of Defense (now renamed “Secretary of War”) Pete Hegseth, Attorney General Pam Bondi, Secretary of Homeland Security Kristi Noem, White House Press spokespersons Karoline Leavitt, Anna Kelly and Steven Cheung, White House Deputy Chief of Staff Stephen Miller, Pentagon and Defense Department spokespersons Kingsley Wilson and Sean Parnell, border czar Thomas Homan and Homeland Security spokesperson Tricia McLaughlin.\n\nSince President Donald Trump typically posts on Truth Social and then reposts them on X, the Herald used his original Truth Social posts.\n\nThe analysis also includes posts made by the official accounts of the State, Defense (renamed “War”), Homeland Security and Justice departments; Customs and Border Protection; Immigration and Customs Enforcement; the White House and the offices of the President and Vice President.\n\nPosts from the social media account of the U.S. Southern Command which oversees defense operations in the region have primarily been focused on publicizing the military actions in the last two months. Those were excluded by the Herald so as to not skew the analysis in any particular direction.\n\nCredits\n\nShirsho Dasgupta | Investigative/Data Reporter\n\nAntonio Delgado | Venezuela Reporter\n\nTrish Wilson | Investigations Editor\n\nBen Wieder | Project Manager, Investigations\n\n©2025 Miami Herald. Visit miamiherald.com. Distributed by Tribune Content Agency, LLC.\n\n"}
{"title": "Trump Says Venezuela's Airspace Should be Viewed as Closed. It's Not Clear What That Means", "publish_time": "20251129", "content": "WEST PALM BEACH, Fla. (AP) — President Donald Trump on Saturday said that the airspace “above and surrounding” Venezuela should be considered as \"closed in its entirety,” an assertion that raised more questions about the U.S. pressure on Venezuelan leader Nicolás Maduro.\n\nThe White House did not respond to questions about what Trump posted on his Truth Social platform, and it was unclear whether he was announcing a new policy or simply reinforcing the messaging around his campaign against Maduro, which has involved multiple strikes in the Caribbean Sea and eastern Pacific Ocean on small boats accused of ferrying drugs as well as a buildup of naval forces in the region. More than 80 people have been killed in such strikes since early September.\n\nThe Republican president addressed his call for an aerial blockade to “Airlines, Pilots, Drug Dealers, and Human Traffickers,” rather than to Maduro. International airlines last week began to cancel flights to Venezuela after the Federal Aviation Administration told pilots to be cautious flying around the country because of heightened military activity.\n\nThe FAA’s jurisdiction is generally limited to the United States and its territories. The agency does routinely warn pilots about the dangers of flying over areas with ongoing conflicts or military activity around the globe, as it did earlier this month with Venezuela. The FAA works with other countries and the International Civil Aviation Organization on international issues. The FAA and ICAO did not immediately respond to requests for comment Saturday.\n\nTrump's administration has sought to ratchet up pressure on Maduro. The U.S. government does not view Maduro as the legitimate leader of the oil-rich but increasingly impoverished South American nation and he faces charges of narcoterrorism in the U.S.\n\nU.S. forces have conducted bomber flights near Venezuela and the USS Gerald R. Ford, America's most advanced aircraft carrier, was sent to the area. The Ford rounds off the largest buildup of U.S. firepower in the region in generations. With its arrival, the “Operation Southern Spear” mission includes nearly a dozen Navy ships and about 12,000 sailors and Marines.\n\nThere are bipartisan calls for greater oversight of the U.S. military strikes against vessels in the region after The Washington Post reported that Defense Secretary Pete Hegseth issued a verbal order for all crew members to be killed as part of the Sept. 2 attack on suspected drug smugglers.\n\nRepublican Sen. Roger Wicker of Mississippi, chairman of the Senate Armed Services Committee, and its top Democrat, Rhode Island Sen. Jack Reed, said in a joint statement late Friday that the committee \"will be conducting vigorous oversight to determine the facts related to these circumstances.”\n\nTrump’s team has weighed both military and nonmilitary options with Venezuela, including covert action by the CIA.\n\nTrump has publicly floated the idea of talking to Maduro. The New York Times reported Friday that Trump and Maduro had spoken. The White House declined to answer questions about the conversation.\n\n___\n\nAssociated Press writer Josh Funk in Omaha, Nebraska, contributed to this report.\n\n"}
{"title": "US Halts All Asylum Decisions as Suspect in Shooting of National Guard Members Faces Murder Charge", "publish_time": "20251129", "content": "WASHINGTON (AP) — The Trump administration has halted all asylum decisions and paused issuing visas for people traveling on Afghan passports days after a shooting near the White House that left one National Guard member dead and another in critical condition.\n\nInvestigators continued Saturday to seek a motive in the shooting, in which the suspect, Rahmanullah Lakanwal, now faces charges including first-degree murder.\n\nLakanwal is a 29-year-old Afghan national who worked with the CIA during the Afghanistan War. He applied for asylum during the Biden administration and was granted it this year under Trump, according to a group that assists with resettlement of Afghans who helped U.S. forces in their country.\n\nThe Trump administration has seized on the shooting to vow to intensify efforts to rein in legal immigration, promising to pause entry from some poor countries and review Afghans and other legal migrants already in the country. That is in addition to other measures, some of which were previously set in motion.\n\nSpecialist Sarah Beckstrom, 20, died after the Wednesday shooting, and Staff Sgt. Andrew Wolfe, 24, was hospitalized in critical condition. They were deployed with the West Virginia National Guard as part of Trump’s crime-fighting mission in the city. The president also has deployed or tried to deploy National Guard members to other cities to assist with his mass deportation efforts but has faced court challenges.\n\nU.S. Attorney Jeanine Pirro’s office said the charges against Lakanwal also include two counts of assault with intent to kill while armed. In an interview on Fox News, she said there were “many charges to come.”\n\nTrump called the shooting a “terrorist attack” and criticized the Biden administration for enabling entry by Afghans who worked with U.S. forces.\n\nThe director of U.S. Citizenship and Immigration Services, Joseph Edlow, said in a post on the social platform X that asylum decisions will be paused “until we can ensure that every alien is vetted and screened to the maximum degree possible.”\n\nExperts say the U.S. has rigorous vetting systems for asylum-seekers. Asylum claims made from inside the country through USCIS have long faced backlogs. Critics say the slowdown has been exacerbated during the Trump administration.\n\nAlso Friday, Secretary of State Marco Rubio said his department paused “visa issuance for ALL individuals traveling on Afghan passports.”\n\nShawn VanDiver, president of the San Diego-based group #AfghanEvac, said in response: “They are using a single violent individual as cover for a policy they have long planned, turning their own intelligence failures into an excuse to punish an entire community and the veterans who served alongside them.”\n\nLakanwal lived in Bellingham, Washington, about 80 miles (130 kilometers) north of Seattle, with his wife and five children, former landlord Kristina Widman said.\n\nNeighbor Mohammad Sherzad said Lakanwal was polite and quiet and spoke little English.\n\nSherzad said he attended the same mosque as Lakanwal and heard from other members that he was struggling to find work. He said Lakanwal “disappeared” about two weeks ago.\n\nLakanwal worked briefly this summer as an independent contractor for Amazon Flex, which lets people use their own cars to deliver packages, according to a company spokesperson.\n\nInvestigators are executing warrants in Washington state and other parts of the country.\n\nLakanwal entered the U.S. in 2021 through Operation Allies Welcome, a Biden administration program that resettled Afghans after the U.S. withdrawal, officials said. Lakanwal applied for asylum during that administration, but his asylum was approved this year under the Trump administration, #AfghanEvac said in a statement.\n\nLakanwal served in a CIA-backed Afghan Army unit, known as one of the special Zero Units, in the southern province of Kandahar, according to a resident of the eastern province of Khost who identified himself as Lakanwal’s cousin and spoke on condition of anonymity for fear of reprisals.\n\nThe man said Lakanwal started out working for the unit as a security guard in 2012 and was later promoted to become a team leader and a GPS specialist.\n\nBeckstrom enlisted in 2023 after graduating high school and served with distinction as a military police officer with the 863rd Military Police Company, the West Virginia National Guard said.\n\n“She exemplified leadership, dedication, and professionalism,” the guard said in a statement, adding that Beckstrom volunteered for the D.C. deployment.\n\n___\n\nAssociated Press journalists Sarah Brumfield, Siddiqullah Alizai, Elena Becatoros, Randy Herschaft, Cedar Attanasio and Hallie Golden contributed.\n\n"}
{"title": "What is Operation Allies Welcome, Which Brought in Afghan Refugees?", "publish_time": "20251129", "content": "After the U.S. military's 2021 withdrawal from Afghanistan and the Taliban's subsequent takeover, Rahmanullah Lakanwal was among more than 76,000 Afghans allowed to resettle in the U.S. for humanitarian reasons.\n\nThe 29-year-old Bellingham resident is now accused of driving cross-country to Washington, D.C., where he allegedly shot two National Guard members on Wednesday, killing one.\n\nFederal investigators have not said what they believe motivated Lakanwal to travel to the nation's capitol, where he is being treated for wounds. In Bellingham on Friday, few were willing to speak openly about the shooting or its potential ties to their city.\n\nBut the shooting has drawn attention to Lakanwal's journey from Afghanistan to Washington state and Operation Allies Welcome, the program that helped him and thousands of other Afghans to resettle in the U.S.\n\nPresident Donald Trump on Wednesday said the U.S. must reexamine\" every Afghan who resettled in the U.S. during his predecessor's administration. The U.S. Citizenship and Immigration Services then announced it had indefinitely halted processing any immigration requests from Afghanistan.\n\nOn Friday, U.S. National Counterterrorism Center director Joe Kent — who ran twice, unsuccessfully, for Congress in Southwest Washington’s 3rd Congressional District — said on X that the U.S. should immediately begin \"rounding up\" and deporting all Afghans who resettled in the country.\n\nHow Lakanwal arrived in the U.S.\n\nFormer President Joe Biden launched the program Aug. 29, 2021, directing the Department of Homeland Security to lead efforts to resettle vulnerable Afghans in the U.S., many for up to two years.\n\nMore than 40% of those brought to the U.S. under Operation Allies Welcome were eligible Special Immigrant Visas because they worked with the U.S. in some way over the prior two decades, or were related to someone who did. Others were allowed to resettle in the U.S. for humanitarian reasons, according to the Department of Homeland Security.\n\nLakanwal was paroled into the U.S. under Operation Allies Welcome on Sept. 8, 2021, according to a statement Wednesday by the Department of Homeland Security.\n\nCIA Director John Ratcliffe said Lakanwal worked with the CIA in Afghanistan, but did not specify what he did for the agency.\n\nLakanwal and his family fled Taliban threats and were granted resettlement in the U.S. on humanitarian grounds, according to CBS. Lakanwal applied for asylum with the U.S. Citizenship and Immigration Service in 2024 and his application was granted this year, with his request for a green card still pending, the outlet reported.\n\nIt is unclear how Lakanwal ended up in Bellingham. A spokesperson for the city declined to comment Friday on the city’s refugee population totals.\n\nUnder Operation Allies Welcome, 3,273 refugees have arrived in Washington, according to the state Department of Social and Health Services.\n\nAfghanistan is the top country of origin for newly arrived refugee applicants in Washington. From October 2024 to June 2025, there were 2,158 Afghan applicants, compared with 371 applications from Ukraine, which had the second-highest number.\n\nMany Afghan refugees were resettled through local agencies in Clark, King, Pierce, Snohomish, Spokane and Whatcom counties, according to an October 2021 report by the state Department of Social and Health Services.\n\nA 'rigorous screening and vetting process'\n\nEvery Afghan evacuee underwent a \"rigorous screening and vetting process\" before being resettled in the U.S. under Operation Allies Welcome, according to the Department of Homeland Security.\n\nThe U.S. deployed about 400 personnel from federal agencies like Customs and Border Protection, Immigration and Customs Enforcement and the Secret Service to sites across the world to process, screen and vet people on a case-by-case basis, according to Homeland Security.\n\nIntelligence, law enforcement and counterterrorism professionals reviewed fingerprints, photos and biographic data of every person before they were cleared to travel into the U.S. Anyone who failed a background check overseas was not permitted to board a flight to the U.S., according to Homeland Security.\n\nAfghans underwent a primary inspection upon arriving in the U.S., and Customs and Border Patrol was authorized to deny anyone entry into the country if there were security concerns. Those granted resettlement were briefed on U.S. laws and rights and the conditions of their parole, including that any illegal activity could lead to their prosecution or imprisonment or loss of their immigration status, according to Homeland Security.\n\nOperation Allies Welcome followed a much shorter timeline than the typical U.S. resettlement process, which includes a vetting process that can take up to two years, according to the United Nations High Commissioner for Refugees.\n\nIn those cases, U.S. immigration officials perform background checks and in-person interviews, using lines of questioning crafted to elicit information about any involvement in terrorist or criminal activity, according to U.S. Citizenship and Immigration Services.\n\nWhat help did U.S. give to those resettling?\n\nStarting July 30, 2021, thousands of evacuated Afghans arrived at eight \"safe havens\" — U.S. military bases in West Virginia, New Mexico, Wisconsin, Texas, New Jersey and Indiana. There, they received medical and mental health services and vaccinations and were connected with nongovernmental organizations to help them with resettlement, according to the Department of Homeland Security.\n\nMore than 200 organizations coordinated with federal officials on resettlement efforts, including faith-based organizations, advocacy groups and state and local governments. Placement for each evacuee factored in any U.S. family or friends, housing availability, \"community capacity and a person's needs, according to Homeland Security.\n\nThose granted humanitarian parole were eligible for eight months for cash and medical assistance, help preparing for and finding jobs and English language training.\n\nIt's unclear what assistance Lakanwal received, or where in the U.S. he was placed before he arrived in Bellingham.\n\nLakanwal spent about a month starting in July as an Amazon Flex independent contractor. He delivered packages to about 50 blocks total and hasn’t been active since, an Amazon spokesperson said Friday. His employment history before that is unclear.\n\nAuthorities believe he and his family lived in Bellingham’s Walton Place housing complex, which provides rent-restricted units for residents not exceeding certain incomes based on household size. The screening also required a criminal background check.\n\nWalton Place was quiet just over 24 hours after the FBI swarmed the unit where authorities believe Lakanwal and his family lived.\n\nWhether because of the holiday weekend or buzzing media attention, few residents could be seen moving about the complex.\n\nAn apparent dent on a bright yellow door smashed in by authorities was the only sign anything was out of the ordinary.\n\nSeattle Times staff reporters Kai Uyehara and Paige Cornwell contributed to this story.\n\n© 2025 The Seattle Times. Visit www.seattletimes.com. Distributed by Tribune Content Agency, LLC.\n\n"}
{"title": "Trump Pushes for More Restrictions on Afghan Refugees. Experts Say Many Are Already in Place", "publish_time": "20251129", "content": "The Trump administration is promising an even tougher anti-immigration agenda after an Afghan national was being charged in the shooting this week of two National Guard members, with new restrictions targeting the tens of thousands of Afghans resettled in the U.S. and those seeking to come, many of whom served alongside American soldiers in the two-decade war.\n\nBut those still waiting to come were already facing stricter measures as part of President Donald Trump’s sweeping crackdown on legal and illegal migration that began when he started his second term in January. And the Afghan immigrants living in the U.S. and now in the administration’s crosshairs were among the most extensively vetted, often undergoing years of security screening, experts and advocates say.\n\nThe suspected shooter, who worked with the CIA during the Afghanistan War, “was vetted both before he landed, probably once he landed, once he applied for asylum,” said Andrew Selee, president of the Migration Policy Institute. “But more importantly, he was almost certainly vetted extensively and much more by the CIA.”\n\nHaris Tarin, a former U.S. official who worked on the Biden-era program that resettled Afghans, predicted that \"as the investigation unfolds, you will see that this is not a failure of screening. This is a failure of us not being able to integrate — not just foreign intelligence and military personnel — but our own veterans, over the past 25 years.”\n\nThe program Operations Allies Welcome initially brought roughly 76,000 Afghans to the United States, many of whom had worked alongside American troops and diplomats as interpreters and translators. The initiative was in place for around one year before shifting to a longer-term program called Operation Enduring Welcome. Almost 200,000 Afghans have been resettled in the U.S. under both programs.\n\nAmong those brought to the U.S. under the program was the alleged shooter, 29-year-old Rahmanullah Lakanwal, who now faces a first-degree murder charge in the death of 20-year-old Specialist Sarah Beckstrom. The other National Guard member who was shot, 24-year-old Staff Sgt. Andrew Wolfe, remains in critical condition.\n\nThose resettlements are now on hold. The State Department has temporarily stopped issuing visas for all people traveling on Afghan passports, Secretary of State Marco Rubio announced late Friday on X.\n\nTrump and his allies have seized on the shooting to criticize gaps in the U.S. vetting process and the speed of admissions, even though some Republicans spent the months and years after the 2021 withdrawal criticizing the Biden administration for not moving fast enough to approve some applications from Afghan allies.\n\nCIA Director John Ratcliffe said Lakanwal “should have never been allowed to come here,” Trump called lax migration policies “the single greatest national security threat facing our nation,” and Vice President JD Vance said Biden’s policy was “opening the floodgate to unvetted Afghan refugees.”\n\nThat rhetoric quickly turned into policy announcements, with Trump saying he would \"permanently pause all migration” from a list of nearly 20 countries, “terminate all of the millions of Biden illegal admissions,” and “remove anyone who is not a net asset to the United States.” Many of these changes had already been set in motion through a series of executive orders over the past 10 months, including most recently in June.\n\n“They are highlighting practices that were already going into place,” said Andrea Flores, a lawyer who was an immigration policy adviser in the Obama and Biden administrations.\n\nLakanwal applied for asylum during the Biden administration, and his request was approved in April of this year after undergoing a thorough vetting, according to #AfghanEvac, a group that helps resettle Afghans who assisted the U.S. during the war.\n\nFlores said the system has worked across administrations: “You may hear people say, ‘Well, he was granted asylum under Trump. This is Trump’s problem.’ That’s not how our immigration system works. It relies on the same bedding. No asylum laws have really been changed by Congress.”\n\nTrump and other U.S. officials have used the attack to demand a re-examination for everyone who came to the U.S. from Afghanistan, a country he called “a hellhole on Earth” on Thursday.\n\n“These policies were already creating widespread disruption and fear among lawfully admitted families. What’s new and deeply troubling is the attempt to retroactively tie all of this to one act of violence in a way that casts suspicion on entire nationalities, including Afghan allies who risked their lives to protect our troops,” Krish O’Mara Vignarajah, president and CEO of Global Refuge, said in a statement Friday.\n\nThis has left the nearly 200,000 Afghans who are currently living across the U.S. in deep fear and shame over the actions of one person in their community. Those in the U.S. are now worrying about their legal status being revoked, while others in the immigration pipeline here and abroad are waiting in limbo.\n\nNesar, a 22-year-old Afghan who arrived in America weeks after the fall of Kabul, said he had just begun to assimilate into life in the U.S. when the attack happened on Wednesday. He agreed to speak to The Associated Press on condition that only his first name be used for fear of reprisals or targeting by immigration officials.\n\n“Life was finally getting easier for me. I’ve learned to speak English. I found a better job,” he said. “But after this happened two days ago, I honestly went to the grocery store this morning, and I was feeling so uncomfortable among all of those people. I was like, maybe they’re now looking at me the same way as the shooter.”\n\nTwo days before the shooting, Nesar and his father, who worked for the Afghan president during the war, had received an interview date of Dec. 13 for their green card application, a moment he said they had been working toward for four years. However, he says it is now unclear if their application will move forward or if their interview will take place.\n\nAnother Afghan national, who also spoke to the AP on the condition of anonymity out of fear of reprisal, said that after fearing for his life under Taliban rule, he felt a sense of peace and hope when he finally received a special immigrant visa to come to the U.S. two years ago.\n\nHe said he thought he could use his experience working as a defense attorney in Afghanistan to contribute to American society. But now, he says the actions of an “extremist who, despite benefiting from the safety and livelihood provided by this country, ungratefully attacked two American soldiers,” he and other Afghans will once again face scrutiny.\n\n“It seems that whenever a terrorist commits a crime, its shadow falls upon me simply because I am from Afghanistan,” he added.\n\n___\n\nAssociated Press writer Renata Brito in Barcelona, Spain contributed to this report.\n\n"}
{"title": "Family of Colombian Man Killed in US Strike in the Caribbean Files Human Rights Challenge", "publish_time": "20251204", "content": "BOGOTA, Colombia (AP) — The family of a Colombian man has filed the first formal challenge to U.S. military strikes on alleged drug-carrying boats, arguing in a petition to the premier human rights watchdog in the Americas that his death was an extrajudicial killing.\n\nThe petition from the family of Alejandro Carranza says the military bombed his fishing boat on Sept. 15, when he was sailing off Colombia’s Caribbean coast, in violation of human rights conventions. The Inter-American Commission on Human Rights received the complaint Tuesday, and while the Trump administration has said it supports the commission's work, the U.S. does not recognize the jurisdiction of an international court associated with the commission. Therefore, any recommendations that could result from the family’s petition would not be binding.\n\nThe family’s attorney, Daniel Kovalik, said Carranza’s four children and spouse want to be compensated as their loved one was their primary breadwinner. He explained that the family chose the commission because of the obstacles that a federal case would face, but the possibility has not been ruled out either.\n\n“The U.S. does not subject itself to accountability, so we’re using the avenues we have before us,\" Kovalik said Wednesday. “We believe that a decision in our favor, combined with public pressure, can get us that compensation and also can end the killings in the Caribbean.”\n\nThe U.S. military has killed more than 80 people since early September, when it began striking vessels that the Trump administration has said were carrying drugs toward the U.S. The strikes began off Venezuela's Caribbean coast and later expanded to the eastern Pacific Ocean.\n\nThe U.S. also has built up its largest military presence in the region in generations, which many see as part of a strategy to pressure Venezuelan President Nicolás Maduro to resign.\n\nThe Trump administration has not provided any details of the people killed in the strikes, but it has insisted that its intelligence confirmed that members of foreign terrorist organizations were operating the targeted vessels.\n\nThe U.S. military's Sept. 15 strike killed three people. Asked at the time what proof the U.S. has that the vessel was carrying drugs, President Donald Trump told reporters that big bags of cocaine and fentanyl were spattered all over the ocean. However, images of what Trump described were not released by the military or the White House.\n\nKovalik denied that Carranza's boat was carrying drugs and said he did not know if other people were on the vessel. Kovalik, who is also representing President Gustavo Petro in the U.S. after the Trump administration imposed sanctions on him, said he met the Carranzas at their home in northern Colombia.\n\nPetro, the leftist leader of a traditional U.S. ally, has called the boat attacks “murders,” questioning the disproportionate use of force.\n\nThe petition cites as evidence of Carranza's killing stories from The New York Times and The Washington Post regarding the family’s allegations and statements by U.S. Secretary of Defense Pete Hegseth. It also says the family has received threats since Carranza's death.\n\n“The victims do not have adequate and effective resources in Colombia to obtain reparations ... moreover, even if such resources existed, the victims could not exercise them safely, given that they have been threatened by right-wing paramilitaries simply for denouncing Mr. Carranza’s murder,” according to the petition, which was first reported by The Guardian.\n\nThe Pentagon did not immediately respond to a request for comment about the complaint.\n\nThe attacks have increasingly come under scrutiny after the Washington Post reported that Hegseth issued a verbal order to “kill everybody” on the first boat targeted by the military and an admiral approved a follow-on strike said to have killed two survivors of the initial hit. Hegseth has said the admiral “made the right call” and he “had complete authority to do” so.\n\nTrump on Tuesday said the U.S. would start doing strikes on land soon, though he didn’t specify where and said attacks might occur in countries besides Venezuela, suggesting Colombia.\n\n“You know, the land is much easier, much easier. And we know the routes they take,” Trump said to reporters. “We know everything about them. We know where they live. We know where the bad ones live. And we’re going to start that very soon, too.”\n\nLater, when asked to elaborate, Trump said he was speaking about countries that are manufacturing and selling fentanyl or cocaine. The president said he heard that Colombia is manufacturing cocaine and selling it to the U.S. Colombia is the world’s top cocaine producer.\n\n“Anybody that’s doing that and selling it into our country is subject to attack,” Trump said. He added a few moments later, “Not just Venezuela.”\n\nDays after Trump confirmed he had a phone call with Maduro, the leader of the South American country acknowledged the call for the first time Wednesday, expressing hope that the conversation could eventually lead to a dialogue between the two governments.\n\nMaduro, during a televised government event, said “the White House called Miraflores Palace” and described his conversation with Trump as “respectful, even ... cordial.” His comments came hours after a flight operated by a U.S. government contractor landed in the airport outside Venezuela’s capital, Caracas, with 266 deported migrants.\n\n“I’ll go further, if that call means that steps are being taken toward a respectful dialogue between states, between countries, then welcome the dialogue, welcome the diplomacy, because we will always seek peace,” Maduro said.\n\n___\n\nGarcia Cano reported from Caracas, Venezuela.\n\n"}
{"title": "Ukrainian Envoys Head to US as Putin Rejects Parts of Peace Plan", "publish_time": "20251204", "content": "Ukrainian negotiators will join a new round of talks in Florida as Russian President Vladimir Putin said some of the points in a U.S.-backed peace plan were unacceptable to him, the latest sign an agreement likely remains distant.\n\nThe negotiations are difficult, and Moscow disagrees with some of what’s been suggested by the U.S., Putin said in an interview to India Today, as cited by the state-run Tass news service. The full interview will be released later on Thursday.\n\nPutin’s comments are likely to cast more doubt over U.S. President Donald Trump’s push to broker a peace deal after almost four years of Russia’s full-scale invasion. Intense shuttle diplomacy over the past few days has failed to break the deadlock as the Kremlin presses Ukraine to hand over control of land that Moscow has failed to seize by force in the east of the country. Kyiv has repeatedly rejected that demand.\n\nTrump said Wednesday that he doesn’t know what the outcome of successive rounds of talks over a deal will be, though he called the last meeting his special envoy, Steve Witkoff, and son-in-law, Jared Kushner, held with Putin in Moscow on Tuesday “reasonably good.”\n\nThe Kremlin earlier described the negotiations that lasted almost five hours as “very useful,” though “a compromise hasn’t been reached yet” on the critical issue of territorial control, Putin’s policy aide Yuri Ushakov told reporters in Moscow.\n\nThe outcome of the talks in Moscow is likely to be top of the agenda when the Ukrainian delegation led by chief negotiator Rustem Umerov meets Witkoff and Kushner in Florida on Thursday. Secretary of State Marco Rubio described their previous round of talks there on Sunday as productive, but complicated.\n\nIn an interview, Putin stuck to his pledge to take over parts of Ukraine which he claims should belong to Russia and said he was determined to achieve it either by force or through other means. The Russian president also repeated his complaint that Kyiv has refused to pull out of the eastern Donbas region that is internationally recognized as Ukraine’s territory.\n\nTrump and his team kicked off their latest peace efforts with a 28-point plan, which caught other mostly European allies off guard. That initial proposal appeared to favor Russia as it pushed Kyiv to give up territory, forfeit ambitions to join NATO and cap the size of its military.\n\nThe most controversial points were subsequently whittled down to make the plan potentially more palatable for Kyiv, though its most recent iteration hasn’t yet been made public.\n\nThe U.S. recently proposed breaking down the 28-point list into four packages for further discussion, Tass cited Putin as saying in the India Today interview.\n\nIn-person and phone contacts are set to continue over the next few days as talks are proceeding quite effectively, Ukrainian President Volodymyr Zelenskyy said in a video address Wednesday evening.\n\n“A dignified peace is only possible if Ukraine’s interests are taken into account,” Zelenskyy said. “Right now, the world clearly feels that there is a real opportunity to end the war, and current diplomatic activity in negotiations must be backed by pressure on Russia.”\n\n___\n\n©2025 Bloomberg L.P. Visit bloomberg.com. Distributed by Tribune Content Agency, LLC.\n\n"}
{"title": "Air Force Pilot Safely Ejects Before F-16 Fighter Jet Crashes in California Desert", "publish_time": "20251204", "content": "TRONA, Calif. — A fighter jet with the Air Force's elite Thunderbirds demonstration squadron crashed in the Southern California desert Wednesday, but the pilot managed to eject safely, the military said.\n\nThe pilot was being treated at a hospital for injuries that were not life-threatening, according to the San Bernardino County Fire Department.\n\nThe F-16C Fighting Falcon crashed around 10:45 a.m. during a training mission “over controlled airspace in California,” according to a statement from Nellis Air Force Base in Nevada.\n\nThe fire department said it had responded to an “aircraft emergency” near Trona, an unincorporated community in the Mojave Desert about 180 miles (290 kilometers) north of Los Angeles.\n\nIn 2022, a Navy F/A-18E Super Hornet crashed near Trona, killing the pilot.\n\nWednesday's crash is under investigation and further information will be released from the 57th Wing Public Affairs Office, the Air Force statement said.\n\nLike the Navy's Blue Angels, the Air Force Thunderbirds perform their famous tight formations at air shows, and train to fly within inches of each other. The brief statement from the Air Force did not give details on the circumstances of the crash.\n\nThe Blue Angels and Thunderbirds have had dozens of crashes in their long histories.\n\nFormed in 1953, the Thunderbirds practice seasonally out of Nellis Air Force Base near Las Vegas. Aircraft based there include F-16 Falcon and F-22 Raptor fighter jets as well as A-10 Warthog ground-attack jets.\n\n"}
{"title": "Putin Says There Are Points He Can't Agree To in the US Proposal to End Russia's War in Ukraine", "publish_time": "20251204", "content": "Russian President Vladimir Putin says some proposals in a U.S. plan to end the war in Ukraine are unacceptable to the Kremlin, indicating in comments published Thursday that any deal is still some ways off.\n\nU.S. President Donald Trump has set in motion the most intense diplomatic push to stop the fighting since Russia launched the full-scale invasion of its neighbor nearly four years ago. But the effort has once again run into demands that are hard to reconcile, especially over whether Ukraine must give up land to Russia and how it can be kept safe from any future aggression by Moscow.\n\nTrump’s special envoy, Steve Witkoff, and son-in-law Jared Kushner, are set to meet with Ukraine’s lead negotiator, Rustem Umerov, later Thursday in Miami for further talks, according to a senior Trump administration official who wasn’t authorized to comment publicly and spoke on condition of anonymity.\n\nPutin said his five-hour talks Tuesday in the Kremlin with Witkoff and Kushner were “necessary” and “useful,” but also “difficult work,” and some proposals were unacceptable.\n\nPutin spoke to the India Today TV channel before visiting New Delhi on Thursday. Before the full interview was broadcast, Russian state news agencies Tass and RIA Novosti quoted some of his remarks in it.\n\nTass quoted Putin as saying that in Tuesday's talks, the sides “had to go through each point” of the U.S. peace proposal, “which is why it took so long.”\n\n“This was a necessary conversation, a very concrete one,” he said, with provisions that Moscow was ready to discuss, while others “we can’t agree to.”\n\nTrump said Wednesday that Witkoff and Kushner came away from their marathon session confident that he wants to find an end to the war. “Their impression was very strongly that he’d like to make a deal,” he added.\n\nPutin refused to elaborate on what Russia could accept or reject, and none of the other officials involved offered details of the talks.\n\n“I think it is premature. Because it could simply disrupt the working regime” of the peace effort, Tass quoted Putin as saying.\n\nEuropean leaders, left on the sidelines by Washington as U.S. officials engage directly with Moscow and Kyiv, have accused Putin of feigning interest in Trump's peace drive.\n\nRussian barrages of civilian areas of Ukraine continued overnight into Thursday. A missile struck Kryvyi Rih on Wednesday night, wounding six people, including a 3-year-old girl, according to city administration head Oleksandr Vilkul.\n\nThe attack on Ukrainian President Volodymyr Zelenskyy’s hometown damaged more than 40 residential buildings, a school and domestic gas pipes, Vilkul said.\n\nA 6-year-old girl died in the southern city of Kherson after Russian artillery shelling wounded her the previous day, regional military administration chief Oleksandr Prokudin wrote on Telegram.\n\nThe Kherson Thermal Power Plant, which provides heat for over 40,000 residents, shut down Thursday after Russia pounded it with drones and artillery for several days, he said.\n\nAuthorities planned emergency meetings to find alternate sources of heating, he said. Until then, tents were erected across the city where residents could warm up and charge electronic devices.\n\nRussia also struck Odesa with drones, wounding six people, while civilian and energy infrastructure was damaged, said Oleh Kiper, head of the regional military administration.\n\nOverall, Russia fired two ballistic missiles and 138 drones at Ukraine overnight, officials said.\n\nMeanwhile, in the Russia-occupied part of the Kherson region, two men were killed by a Ukrainian drone strike on their vehicle Thursday, Moscow-installed regional leader Vladimir Saldo said. A 68-year-old woman was also wounded in the attack, he said.\n\n___\n\nAamer Madhani in Washington contributed.\n\n"}
{"title": "New York Times Suing Pentagon Over Defense Secretary Pete Hegseth’s New Press Rules", "publish_time": "20251204", "content": "NEW YORK (AP) — The New York Times filed a lawsuit Thursday against the Pentagon, attempting to overturn new rules imposed by Defense Secretary Pete Hegseth that have led to most mainstream media outlets being banished from the building.\n\nThe newspaper said the rules violate constitutional freedom of speech and due process provisions, since they give Hegseth the power to determine on his own whether a reporter should be banned. Outlets like The Times walked out of the Pentagon rather than agree to the rules as a condition for getting a press credential.\n\nThe Trump administration has instead populated the Pentagon press room with mostly conservative outlets that agreed to the rules, who participated Tuesday in a briefing with Hegseth's press secretary.\n\n“The policy is an attempt to exert control over reporting the government dislikes,” said Charles Stadtlander, spokesman for the newspaper. The Times filed the case with the U.S. District Court in Washington, D.C.\n\nDespite losing credentials, outlets denied access to the Pentagon have continued reporting on the U.S. military. They've led coverage this past week on stories that questioned Hegseth's role in military strikes on boats with alleged drug smugglers, including one targeted with a second strike after survivors were spotted.\n\nNevertheless, the Times said denial of access to the Pentagon restricts its reporters' ability to do their job. Since the new policy gives Hegseth the right to oust reporters working on stories he doesn't like — even if they don't involve classified information — it has a chilling effect on journalists, the newspaper argued in court papers. Lawyers are also concerned similar restrictions will be put in place at other federal agencies.\n\nThe Pentagon has argued that the policy imposes “common sense” rules that protect the military from release of information that could put them in danger. During her briefing on Tuesday, Pentagon press secretary Kingsley Wilson said the legacy media outlets aren't missed.\n\n“The American people don’t trust these propagandists because they stopped telling the truth,” Wilson said. “So, we’re not going to beg these old gatekeepers to come back and we’re not rebuilding a broken model just to appease them.”\n\nSeveral news outlets whose coverage reaches millions of people, including The Associated Press, Washington Post and CNN, asked the Pentagon for access to Wilson's briefing Tuesday and were denied, told it was for credentialed press only.\n\nThe Times is citing Wilson's “propagandists” comment as evidence that the Pentagon is discriminating against reporters for their points of view — the same argument that The Associated Press is making to stop President Donald Trump from denying access to its journalists to events in the Oval Office and Air Force One. The AP case is currently wending its way through the federal court system.\n\nTimes lawyers say it believes their viewpoint discrimination case is stronger, since its reporters no longer have credentials to enter the Pentagon. AP journalists are able to enter the White House, but not to some specific newsmaking events being held there.\n\nIts case is being filed on behalf of the newspaper and one of its reporters, Julian E. Barnes. The Defense Department, Hegseth and chief Pentagon spokesman Sean Parnell are named as defendants.\n\nWhile going it alone in its lawsuit in order to move quickly, The Times said it would welcome the support of fellow news organizations.\n\n___\n\nDavid Bauder writes about the intersection of media and entertainment for the AP. Follow him at http://x.com/dbauder and https://bsky.app/profile/dbauder.bsky.social\n\n"}
{"title": "Trump Praises Congo and Rwanda as They Sign US-Mediated Peace Deal", "publish_time": "20251204", "content": "WASHINGTON (AP) — President Donald Trump praised the leaders of the Democratic Republic of Congo and Rwanda for their courage as they signed onto a deal on Thursday aimed at ending the conflict in eastern Congo and opening the region's critical mineral reserves to the U.S. government and American companies.\n\nThe moment offered Trump — who has repeatedly and with a measure of exaggeration boasted of brokering peace in some of the world's most entrenched conflicts — another chance to tout himself as a dealmaker extraordinaire on the global stage and make the case that he's deserving of the Nobel Peace Prize. The U.S. leader hasn't been shy about his desire to receive the honor.\n\n“It’s a great day for Africa, a great day for the world,” Trump said shortly before the leaders signed the pact. He added, \"Today, we’re succeeding where so many others have failed.”\n\nTrump welcomed Presidents Felix Tshisekedi of Congo and Paul Kagame of Rwanda, as well as several officials from other African nations who traveled to Washington to witness the signing, in the same week he contemptuously derided the war-torn country of Somalia and said he did he did not want immigrants from the East African nation in the U.S.\n\nLauded by the White House as a “historic” agreement brokered by Trump, the pact between Tshisekedi and Kagame follows monthslong peace efforts by the U.S. and partners, including the African Union and Qatar, and finalizes an earlier deal signed in June.\n\nBut the Trump-brokered peace is precarious.\n\nThe Central African nation of Congo has been battered by decadeslong fighting with more than 100 armed groups, the most potent being the Rwanda-backed M23 rebels. The conflict escalated this year, with M23 seizing the region’s main cities of Goma and Bukavu in an unprecedented advance, worsening a humanitarian crisis that was already one of the world’s largest, with millions of people displaced.\n\nFighting, meanwhile, continued this week in the conflict-battered region with pockets of clashes reported between the rebels and Congolese soldiers, together with their allied forces. Trump, a Republican, has often said that his mediation has ended the conflict, which some people in Congo say isn't true.\n\nStill, Kagame and Tshisekedi offered a hopeful tone as they signed onto to the agreement.\n\n“No one was asking President Trump to take up this task. Our region is far from the headlines,” Kagame said. “But when the president saw the opportunity to contribute to peace, he immediately took it.”\n\n“I do believe this day is the beginning of a new path, a demanding path, yes. Indeed, quite difficult,\" Tshisekedi said. \"But this is a path where peace will not just be a wish, an aspiration, but a turning point.”\n\nIndeed, analysts say Thursday's deal also isn't expected to quickly result in peace. A separate peace deal has been signed between Congo and the M23.\n\n“We are still at war,” said Amani Chibalonza Edith, a 32-year-old resident of Goma, eastern Congo's key city seized by rebels early this year. “There can be no peace as long as the front lines remain active.\"\n\nBut Trump predicted with the signing the countries would leave behind “decades of violence and bloodshed” and “begin a new year of harmony and cooperation.”\n\n“They spent a lot of time killing each other,” Trump said. “And now they’re going to spend a lot of time hugging, holding hands and taking advantage of the United States of America economically like every other country does.”\n\nTshisekedi and Kagame did not shake hands and barely looked at each other during the roughly 50-minute signing ceremony.\n\nThursday’s pact will also build on a Regional Economic Integration Framework previously agreed upon that officials have said will define the terms of economic partnerships involving the three countries.\n\nTrump also announced the United States was signing bilateral agreements with the Congo and Rwanda that will unlock new opportunities for the United States to access critical minerals -- deals that will benefit all three nations’ economies.\n\n“And we’ll be involved with sending some of our biggest and greatest U.S. companies over to the two countries,” Trump said. He added, “Everybody’s going to make a lot of money.”\n\nThe region, rich in critical minerals, has been of interest to Trump as Washington looks for ways to circumvent China to acquire rare earths, essential to manufacturing fighter jets, cell phones and more. China accounts for nearly 70% of the world’s rare earth mining and controls roughly 90% of global rare earths processing.\n\nTrump hosted the leaders on Thursday morning for one-on-one meetings at the White House as well as a three-way conversation before the signing ceremony at the Institute of Peace in Washington, which the State Department announced on Wednesday has been rebranded “the Donald J. Trump Institute of Peace.”\n\nLater Thursday, the U.S. Chamber of Commerce will host an event that will bring together American business leaders and the Congolese and Rwandan delegations to discuss potential investment opportunities in critical minerals, energy and tourism.\n\nIn eastern Congo, meanwhile, residents reported pockets of clashes and rebel advances in various localities. Both the M23 and Congolese forces have accused each other of violating the terms of the ceasefire agreed earlier this year. Fighting has also continued in the central plateaus across South Kivu province.\n\nThe hardship in the aftermath of the conflict has worsened following U.S. funding cuts that were crucial for aid support in the conflict.\n\nIn rebel-held Goma, which was a regional hub for security and humanitarian efforts before this year’s escalation of fighting, the international airport is closed. Government services such as bank operations have yet to resume and residents have reported a surge in crimes and in the prices of goods.\n\n“We are waiting to see what will happen because so far, both sides continue to clash and attack each other,” said Moise Bauma, a 27-year-old student in rebel-held Bukavu city.\n\nBoth Congo and Rwanda, meanwhile, have touted American involvement as a key step towards peace in the region.\n\n“We need that attention from the administration to continue to get to where we need to get to,” Makolo said. “We are under no illusion that this is going to be easy. This is not the end but it’s a good step.”\n\nThe conflict can be traced to the aftermath of the 1994 genocide in Rwanda, where Hutu militias killed between 500,000 and 1 million ethnic Tutsi, as well as moderate Hutus and Twa, Indigenous people. When Tutsi-led forces fought back, nearly 2 million Hutus crossed into Congo, fearing reprisals.\n\nRwandan authorities have accused the Hutus who fled of participating in the genocide and alleged that elements of the Congolese army protected them. They have argued that the militias formed by a small fraction of the Hutus are a threat to Rwanda’s Tutsi population.\n\nCongo's government has said there can't be permanent peace if Rwanda doesn't withdraw its support troops and other support for the M23 in the region. Rwanda, on the other hand, has conditioned a permanent ceasefire on Congo dissolving a local militia that it said is made up of the Hutus and is fighting with the Congolese military.\n\nU.N. experts have said that between 3,000 and 4,000 Rwandan government forces are deployed in eastern Congo, operating alongside the M23. Rwanda denies such support, but says any action taken in the conflict is to protect its territory.\n\n___\n\nAsadu reported from Abuja, Nigeria, and Madhani from Washington. Justin Kabumba contributed to this report from Goma, Congo.\n\n"}
{"title": "Lockheed Martin Opens $17 Million Hypersonic Facility in Alabama", "publish_time": "20251204", "content": "Lockheed Martin has opened its $17 million, 17,000-square-foot Hypersonics System Integration Lab on its Huntsville campus.\n\nThe integration facility will bring together advanced test equipment, simulation tools and an integration environment under one roof. The new facility will shorten development cycles and fielding higher performance systems for the U.S. Army.\n\nThe facility was completed in one year.\n\n“Lockheed Martin’s commitment to North Alabama is stronger than ever, and this new facility is a clear demonstration of that dedication,” said Jim Romero, vice president of Hypersonic Strike Weapon Systems for Lockheed Martin Space. “Built to house advanced engineering and integration capabilities, it will play a pivotal role in positioning Lockheed Martin as the industry leader in hypersonic defense and deterrence technology. We’re proud to celebrate the addition of this advanced hub to our Huntsville campus.”\n\nHypersonic weapons, capable of traveling at five times the speed of sound, have become a central pillar of that modernization effort.\n\n“Hypersonic weapons are reshaping the future of military defense by delivering unmatched speed and maneuverability that outpace traditional threats,” said Holly Molmer, program management director for Lockheed Martin. “Their rapid response capability strengthens deterrence, ensuring potential adversaries understand that any aggression can be met instantly and decisively. As the pace of conflict accelerates, hypersonic systems become essential to preserving peace and protecting national security.”\n\nSince 2021, Lockheed Martin’s Strategic and Missile Defense Systems division has invested more than $185 million to add nearly 408,000 square feet of new and upgraded space. The effort is part of a larger capital program that now totals roughly $529 million and 719,000 square feet of facilities under construction or planned. In the last five years, Lockheed Martin Strategic and Missile Defense has spent about $200 million on over 400,000 square feet of infrastructure and is poised to commit another $500 million to further expand its capabilities.\n\n“Our continued investment in world‑class facilities underscores Lockheed Martin’s commitment to providing the engineers, scientists and partners with the space, tools and collaborative environments they need to stay ahead of emerging threats,” said Johnathon Caldwell, vice president and general manager of Strategic and Missile Defense Systems at Lockheed Martin. “By expanding our footprint today, we are building the foundation for the next generation of defense solutions that will protect our nation tomorrow.”\n\nLocally, that investment includes expanding its missile assembly campus on a former World War II U.S. Army Air Corps site in north Alabama.\n\nLockheed-Martin Next Generation Interceptor and Space Vice President Sarah Reeves told AL.com the company expects to complete an 88,000 square-foot assembly plant in Courtland for the long-range ballistic missile defense interceptor - Next Generation Interceptor – by early next year.\n\nLockheed Martin is one of several companies with a Huntsville presence that are expected to play a major role in President Donald Trump’s Golden Dome defense initiative.\n\n©2025 Advance Local Media LLC. Visit al.com. Distributed by Tribune Content Agency, LLC.\n\n"}
{"title": "The Shooting in DC by an Afghan Suspect Shouldn’t Reflect on All Afghanistan, Minister Says", "publish_time": "20251204", "content": "JALALABAD, Afghanistan (AP) — An Afghan national charged in the shooting of two U.S. National Guard members last week had been previously trained by American forces, and his actions should not reflect on the people of Afghanistan, the country's foreign minister said.\n\nThe remarks by Amir Khan Muttaqi were the first public comments on the case by Afghanistan's Taliban government. Muttaqi spoke during a meeting of community elders on Wednesday, according to a statement released by his ministry.\n\nRahmanullah Lakanwal, 29, has been charged with first-degree murder after one of the two victims, West Virginia National Guard Specialist Sarah Beckstrom, 20, died of wounds sustained in the Nov. 26 shooting. The second victim, Staff Sgt. Andrew Wolfe, 24, was critically wounded.\n\nLakanwal pleaded not guilty on Tuesday to murder and assault charges during his first hearing before a judge in Washington, D.C.. He appeared remotely by video from a hospital bed as he was also shot during last week's attack.\n\n“This is an individual incident and the person who committed this act was trained by the Americans,” Muttaqi said, adding that “this issue has nothing to do with the noble people of Afghanistan.”\n\nIn the wake of the shooting, the U.S. government has introduced sweeping immigration changes, including pausing asylum applications and requiring increased vetting for certain immigrants.\n\nIn Afghanistan, Lakanwal had worked in one of the special Afghan Army units known as Zero Units, which were backed by the CIA. He entered the United States in 2021 through Operation Allies Welcome, a program that evacuated and resettled tens of thousands of Afghans after the Taliban seized power during the chaotic withdrawal of American and NATO troops. Many of those evacuated had worked alongside U.S. troops and diplomats.\n\n“We have been saying for 20 years” that those operating as part of the Zero Units “have caused thousands of incidents in Afghanistan” and were also responsible for the deaths of Afghan citizens, Muttaqi said.\n\nU.S. forces “personally trained this person, made him their official employee,” the minister added, and described the evacuation in which Lakanwal fled Afghanistan for the United States as “an illegal process that did not comply with any international principles.”\n\n___\n\nAssociated Press writer Elena Becatoros in Athens, Greece, contributed to this report.\n\n"}
{"title": "Marine Dies in Training Exercise at Camp Pendleton", "publish_time": "20251204", "content": "LOS ANGELES (AP) — A U.S. Marine died during a training exercise Wednesday at Camp Pendleton in Southern California, military officials said.\n\nThe Marine died of injuries sustained in a “tactical vehicle mishap” in the afternoon, the I Marine Expeditionary Force said in a statement.\n\nThe Marine's name was not released, and the cause of the incident was under investigation. Officials said the death was not related to Steel Knight, an annual, large-scale training exercise that began Monday on the base.\n\nNo further details were given.\n\nThe I Marine Expeditionary Force is the largest of the three Marine expeditionary forces and is located on the coast in San Diego County.\n\n"}
{"title": "Israel Says It Will Start Letting Palestinians Leave Gaza Through Reopened Border Crossing", "publish_time": "20251203", "content": "JERUSALEM — Israel on Wednesday said it will start letting Palestinians leave Gaza through a reopened border crossing, complying with a U.S.-backed ceasefire deal even though it also said that partial remains returned by militants did not match the hostages still in Gaza.\n\nThe missing remains of the two hostages threaten to stall a ceasefire between Israel and Hamas in its first phase. But by promising to open the Rafah crossing, Israel showed it was moving ahead with parts of the plan.\n\nThe first phase of the plan is supposed to wind down with the return of the two remaining hostages. Palestinian militants, who appear to be struggling to find the remains amid the rubble of war-torn Gaza, said they were searching again on Wednesday.\n\nFollowing the exchanges, the 20-point plan calls for creating an international stabilization force, forming a technocratic Palestinian government and disarming Hamas.\n\nThe World Health Organization says there are more than 16,500 sick and wounded people who need to leave Gaza for medical care.\n\nTwo hostage bodies are still in Gaza: Israeli Ran Gvili and Thai national Sudthisak Rinthalak. In a statement Wednesday, the Prime Minister’s Office said forensic testing showed that remains returned Tuesday did not match either.\n\nSaraya al-Quds, the military arm of Palestinian Islamic Jihad, said its militants were moving to northern Gaza Wednesday morning to search for the remains.\n\nThe group said on its Telegram channel that the militants were accompanied by workers from the Red Cross.\n\nGvili was an Israeli police officer who helped people escape from the Nova music festival on Oct. 7, 2023, and was killed fighting at another location.\n\nSudthisak Rinthalak was an agricultural worker from Thailand who had been employed at Kibbutz Be’eri, one of the hardest-hit communities in the attack.\n\nA total of 31 workers from Thailand were abducted, the largest group of foreigners to be held in captivity. Most of them were released in the first and second ceasefires. The Thai Foreign Ministry has said in addition to the hostages, 46 Thais have been killed during the war.\n\nHamas has yet to comment on the latest handover or the news about the missing remains.\n\nTwenty living hostages and the remains of 26 others have been returned to Israel since the ceasefire began in early October. Both Hamas and Israel have accused the other of breaking the ceasefire multiple times.\n\nThe statement about opening Rafah came from COGAT, the Israeli military body charged with facilitating aid to Gaza.\n\nIt said Israel would coordinate with Egypt on the exit of Palestinians, under the supervision of a mission from the European Union. Those wishing to leave Gaza will require “Israeli security approval,\" COGAT said.\n\nThe ceasefire deal calls for the crossing to be opened for medical evacuations and for travel to and from the strip.\n\nBut an Israeli official, who spoke anonymously to discuss operational plans, said that all Palestinians who want to exit Gaza will be able to exit through Rafah as long as Egypt agrees to receive them, but the crossing won't be open for people wishing to return to Gaza. The official said the EU still had to make some adjustments to logistics before the crossing could open.\n\nThe crossing was sealed off in May 2024 when Israel’s military invaded the area. It was briefly opened in February this year for the evacuation of sick and wounded Palestinians for treatment, as part of the previous ceasefire deal.\n\nIsraeli Prime Minister Benjamin Netanyahu said Wednesday he appointed an envoy to join talks with Lebanese diplomatic and economic officials.\n\nNetanyahu’s office called the appointment “the initial attempt to create a basis for relations and economic cooperation” between the two countries. It did not say when or where the talks would be held.\n\nNetanyahu's office said the appointment would come from the office of his national security adviser. Israeli media identified the envoy as Uri Resnick, a former diplomat and the council’s deputy director for foreign policy.\n\nIsrael and the Lebanon have been in a state of war since 1948. Israel and the Lebanese militant group Hezbollah fought a months-long war that ended in a shaky ceasefire one year ago.\n\nA Palestinian man was killed by Israeli fire on Wednesday in Gaza Strip, a hospital said, marking the latest reported Palestinian fatality in Gaza.\n\nIsraeli forces shot the 46-year-old man in Gaza City’s eastern Zeitoun neighborhood, according to the Al-Ahli hospital, which received the body. Israel's military did not immediately respond to request for comment.\n\nThe hospital said the man was shot while in the “safe zone,” which, under the terms of the ceasefire, is not controlled by the Israeli military.\n\nThe Gaza Health Ministry says more than 360 Palestinians have been killed across Gaza since the ceasefire took effect on Oct. 11. The ministry sets the total Palestinian death toll from the war over 70,100. The ministry does not distinguish between militants and civilians, though it says roughly half of those killed have been women and children. The ministry operates under the Hamas-run government. It is staffed by medical professionals and maintains detailed records viewed as generally reliable by the international community.\n\nThe exchanges of the dead have been the central component of the initial phase of the U.S.-brokered agreement, which requires Hamas to return all hostages' remains as quickly as possible. Without the return of hostage remains, it seemed unlikely that Israel would release more Palestinian bodies on Wednesday.\n\nIsrael has been releasing 15 Palestinian bodies for the remains of each hostage as part of the ceasefire agreement. The Gaza Health Ministry said the total number of remains received so far is 330. Health officials in Gaza have said they have only been able to identify a fraction of the bodies handed over by Israel, and the process is complicated by a lack of DNA testing kits.\n\nThe exchanges have gone ahead even as Israel and Hamas have accused each other of violating other terms of the deal. Israeli officials have accused Hamas of handing over partial remains in some instances and staging the discovery of bodies in others.\n\nHamas has accused Israel of opening fire on civilians and restricting the flow of humanitarian aid into the territory. The number of casualties has dropped since the ceasefire took effect, but officials in Gaza have continued to report deaths from strikes, while Israel has said that soldiers have also been killed in militant attacks.\n\nThe ceasefire aims to wind down the war that was triggered by the Hamas-led attack on southern Israel, which killed about 1,200 people and saw 251 taken hostage.\n\n___\n\nMagdy reported from Cairo.\n\n"}
{"title": "Americans’ Confidence in Military Lowest Since 2018 As Support Grows For NATO, Ukraine: National Defense Survey", "publish_time": "20251203", "content": "Americans believe a strong military will provide better opportunity for global peace though the means to an end is viewed in a wide lens based on political partisanship, according to the Dec. 4 release of the 2025 Reagan National Defense Survey.\n\nThe public opinion poll annually conducted since 2018 by polling firms for the Reagan Institute highlights national sentiment on defense and national security issues, in turn providing public officials, policymakers and other stakeholders with Americans’ more nuanced views on key issues with global implications. Polls are released each year in the summer and winter.\n\nThis year’s telephone and online survey of approximately 2,500 U.S. adults shows Americans’ wanting for the U.S. military to be a beacon for global engagement and pushing peace through strength, including bolstering American superiority on the world stage and taking a lead on international affairs.\n\nThe poll also finds agreement across partisan lines on issues like providing more weapons to Ukraine in its years-long war with Russia, or supporting Taiwan and providing military assistance should China invade the East Asian country.\n\nOverall, Americans surveyed expressed affinity for a strong global posture and a capable military force.\n\nApproximately 64% of respondents responded that they want the U.S. to be more engaged and lead in international affairs, with 87% saying the U.S. having the most powerful military in the world is important. Another 71% said global peace is more attainable when the U.S. is the strongest global power.\n\nNumbers vary based on political proclivities, with support from 79% of MAGA Republicans and 57% of Democrats. But nearly every demographic group, including across age and education levels, shows increased support for greater global leadership.\n\n“That upward trend is being driven by the Republican demographic but it has been increasing across a number of different demographics, from age demographics, regional breakdowns and the like,” Rachel Hoff, policy director at the Ronald Reagan Institute, told media members during the survey’s unveiling. “That upward trend is really something that we're seeing across the board.”\n\nNumbers become more convoluted when factoring in military superiority plus trust and confidence in the military as an institution, and issues related to department name changes and the deployment of National Guard troops in American cities.\n\nThe survey found that 54% of Americans have a high confidence that the military can keep the country safe, though just 49% believe it can win a war overseas. Another 45% said the U.S. military can deter foreign aggression.\n\nU.S. service branches are viewed in a favorable light by the majority of respondents, finding superiority in air forces (68%), naval forces (58%), space capabilities (56%), and overall military strength (55%).\n\nNumbers are smaller but still strong when asked about U.S. diplomatic influence (48%), ground forces (43%), economic strength (42%) and autonomous capabilities (40%).\n\nOne of the most glaring data points is related to the public’s perception of the U.S. military.\n\nThe poll shows 49% of Americans reporting a great deal of confidence—a significant decline of 21 percentage points since the first Reagan National Defense Survey in 2018. However, pollsters note that the current figure is roughly consistent with results from 2024.\n\n“That flat line trend is sort of masking some partisan division,” Hoff said. “Just in the last year confidence among Democrats has fallen over 10 points and similarly, confidence among Republicans has increased around 10 points.\n\n“So, even though that trend looks stable, it is sort of masking some upward and downward trends on either side of the political identification coin.”\n\nThe political and age divides are more stark.\n\nRepublicans’ high confidence in the U.S. military increased from 48% in 2023 to 67% this year, whereas high confidence among Democrats fell from 47% to 33%. And while members of both main political parties expressed a willingness to recommend military service—at a clip of 59%, up eight points from the 51% who said the same in 2023—the numbers are mixed, as 77% of Republicans would encourage service versus only 43% of Democrats.\n\nThe age gap in military trust also falls by generation, as 36% of those under 30 years of age; 44% of those aged 30–44; 53% of those 45–64; and 60% of those 65 and older have varied sentiments.\n\nPartisanship is emboldened among other aspects of the military, like the Trump administration’s decision to rename the Department of Defense to the Department of War. A total of 59% of those surveyed disapprove of the decision, but 58% of Republicans like it while only 17% of Democrats approve.\n\nThere is also a significant distinction in the way individuals on both sides of the aisle view support for using active-duty troops or federalized National Guard units to reinforce border security and assist local police in major civil disturbances. Approximately 61% overall said they approved regarding the border (87% of Republicans and 33% of Democrats) and numbers remained consistent regarding civil disturbances (55% overall and 85% of support from Republicans but 28% in opposition by Democrats).\n\nWhen it comes to issues like diversity, equity and inclusion (DEI) in the Pentagon, the partisan differences could not be more clear: Roughly 75% of Republican respondents said they approve its elimination while about 75% of Democrats feel the opposite.\n\nAmericans view NATO in a favorable light at its highest ever levels across all Reagan Institute polling at 68%. That goes across bipartisan lines, with 80% of Democratic approval and 60% from Republicans—up from 50% in June, prior to the 2025 NATO Summit in The Hague.\n\n“This is one [example] where clearly the Trump administration—President [Donald] Trump's embrace of NATO, a result of the policies that he's championed being adopted by NATO—what it's done is that it's increased Republican support. … There are some other issues where you see Republican enthusiasm and support at the same time results in a loss of enthusiasm and support on the part of Democrats. NATO is not one of them,” said Roger Zakheim, director of the Ronald Reagan Institute, in a conference call.\n\nAnother 76% overall, including nearly 8-in-10 Republicans and Democrats, said they support a U.S. military response if a NATO ally was attacked.\n\nAlso, support for the use of Article V—which is the NATO creed that an attack against one NATO nation is an attack on all of them—rose 5% since June.\n\n“It reflects the durability, the bipartisan support of NATO,” Zakheim said. “And irrespective, at least from a Democratic standpoint, of who is the president—Republican President Donald Trump or Democratic President Joe Biden—they're going to support NATO.\n\n“There's always been that same durable Republican support but skeptical Republicans did not favor NATO under Joe Biden's leadership. [They] now have been swayed to support NATO as a result of President Trump's policies and support for NATO. I think that's a pretty unique story that we're seeing.”\n\nUkraine, a country that has tried for NATO entry since Russia launched its invasion in February 2022, continues to receive strong U.S. support from both Republicans and Democrats.\n\nA majority of Americans (62%, including 57% of Republicans and 72% of Democrats) responded that they want Ukraine to be victorious, including a nine-point jump to 64% among those who think the U.S. should continue sending weapons overseas. That latter figure includes 59% of Republicans.\n\nThe strategy behind the war’s conclusion also reached levels of unison. Both parties’ members favor full territorial sovereignty on Ukraine’s behalf.\n\n“Overall, our Ukraine numbers have shifted across the board toward more support,” Hoff said. “Sixty-two percent of Americans, including a majority of both Republicans and Democrats, say they want Ukraine to win the war. Americans…perceive Russia as an adversary; they perceive Ukraine as an ally.”\n\nShe mentioned newer questions this year, including one on sending long-range cruise missiles such as Tomahawks in particular which is supported by 65% of Americans. Another 68% support sending American-made weapons to European allies, and then in turn those allies providing those weapons to Ukraine.\n\n"}
{"title": "Pete Hegseth Faces Deepening Scrutiny from Congress Over Boat Strikes", "publish_time": "20251203", "content": "WASHINGTON — Pete Hegseth barely squeaked through a grueling Senate confirmation process to become secretary of defense earlier this year, facing lawmakers wary of the Fox News Channel host and skeptical of his capacity, temperament and fitness for the job.\n\nJust three months later, he quickly became embroiled in Signalgate as he and other top U.S. officials used the popular Signal messaging application to discuss pending military strikes in Yemen.\n\nAnd now, in what may be his most career-defining moment yet, Hegseth is confronting questions about the use of military force after a special operations team reportedly attacked survivors of a strike on an alleged drug boat off the coast of Venezuela. Some lawmakers and legal experts say the second strike would have violated the laws of armed conflict.\n\n“These are serious charges, and that’s the reason we’re going to have special oversight,” said Sen. Roger Wicker of Mississippi, the Republican chair of the Senate Armed Services Committee.\n\nThe scrutiny surrounding Hegseth’s brash leadership style is surfacing what has been long-building discontent in Congress over President Donald Trump’s choice to helm the U.S. military. And it’s posing a potentially existential moment for Hegseth as the congressional committees overseeing the military launch an investigation amid mounting calls from Democratic senators for his resignation.\n\nSince working to become defense secretary, Hegseth has vowed to bring a “warrior culture” to the U.S. government's most powerful and expensive department, from rebranding it as the Department of War to essentially discarding the rules that govern how soldiers conduct themselves when lives are on the line.\n\nHegseth on Tuesday cited the “fog of war” in defending the follow-up strike, saying that there were explosions and fire and that he did not see survivors in the water when the second strike was ordered and launched. He chided those second-guessing his actions as being part of the problem.\n\nYet the approach to the operation was in line with the direction of the military under Hegseth, a former infantry officer with the Army National Guard, part of the post-Sept. 11 generation, who was deployed to Iraq and Afghanistan and earned Bronze Stars.\n\nDuring a speech in September, he told an unusual gathering of top military brass whom he had summoned from all corners of the globe to the Quantico Marine Corps Base in Virginia that they should not “fight with stupid rules of engagement.”\n\n“We untie the hands of our warfighters to intimidate, demoralize, hunt and kill the enemies of our country,” he said. “No more politically correct and overbearing rules of engagement, just common sense, maximum lethality and authority for warfighters.”\n\nBut now lawmakers and military and legal experts say the Sept. 2 attack borders on illegal military action.\n\n“Somebody made a horrible decision. Somebody needs to be held accountable,” said Sen. Thom Tillis, a North Carolina Republican who in January held out support for Hegseth until only moments before casting a crucial vote for his confirmation.\n\n“Secretary Talk Show Host may have been experiencing the ‘fog of war,’ but that doesn’t change the fact that this was an extrajudicial killing amounting to murder or a war crime,” said Sen. Chris Van Hollen, D-Md. “He must resign.”\n\nRep. Don Bacon, a Republican who served 30 years active duty in the Air Force, finishing his career at the rank of brigadier general, said he hasn't been a fan of Hegseth's leadership. \"I don’t think he was up to the task,” Bacon said.\n\nTrump, a Republican, has largely stood by his defense secretary, among the most important Cabinet-level positions. But the decisions by Wicker, alongside House Armed Services Chair Mike Rogers of Alabama and the top Democrats on the committees, to open investigations provide a rare moment of Congress asserting itself and its authority to conduct oversight of the Trump administration.\n\nSenate Majority Leader John Thune, R-S.D., who shepherded the defense secretary’s nomination to confirmation, has said the boat strikes are within Trump’s authority as commander in chief — and he noted that Hegseth serves at the pleasure of the president.\n\n“I don’t have, at this point, an evaluation of the secretary,” Thune said at the start of the week. “Others can make those evaluations.”\n\nBut Hegseth also has strong allies on Capitol Hill, and it remains unclear how much Republicans would actually be willing to push back on the president, especially when they have spent the first year in his administration yielding to his various demands.\n\nVice President JD Vance, who cast a rare tiebreaking vote to confirm Hegseth, has vigorously defended him in the attack. And Sen. Eric Schmitt, another close ally to Trump, dismissed criticism of Hegseth as “nonsense\" and part of an effort to undermine Trump's focus on Central and South America.\n\n“He’s not part of the Washington elite,\" said Schmitt, R-Mo. “He’s not a think tanker that people thought Trump was going to pick. ... And so, for that reason and others, they just, they don’t like him.”\n\nTension between some Republican lawmakers and the Pentagon has been rising for months. Capitol Hill has been angered by recent moves to restrict how defense officials communicate with lawmakers and the slow pace of information on Trump's campaign to destroy boats carrying drugs off the coast of Venezuela.\n\nAs he defends his job, Hegseth has spoken to both Wicker and Rogers, the top lawmakers overseeing the military. Rogers said he was “satisfied” with Hegseth after that conversation, while Wicker said that he told Hegseth that he would like him to testify to Congress.\n\nHegseth at first tried to brush aside the initial report about the strike by posting a photo of the cartoon character Franklin the Turtle firing on a boat from a helicopter, but that only inflamed criticism of him and angered lawmakers who felt he was not taking the allegations seriously.\n\nSenate Democratic leader Chuck Schumer of New York called Hegseth a “national embarrassment,” adding the defense secretary’s social media post of the cartoon turtle is “something no serious leader would ever think of doing.”\n\nLater this week, the chairs of the armed services committees, along with the top Democrats on the committees, will hear private testimony from Navy Vice Adm. Frank “Mitch” Bradley, who the White House has said ordered the second strike on the survivors.\n\nRepublicans have been careful to withhold judgment on the strike until they complete their investigation, but Democrats say that these problems with Hegseth were a long time coming.\n\nSen. Tim Kaine, a Virginia Democrat, pointed back to Hegseth's tumultuous confirmation hearing, at which issues were raised with his management of nonprofits, as well as allegations of a sexual assault and abuse, and drinking on the job. Hegseth had vowed not to consume alcohol if confirmed.\n\n“You don’t suddenly change your judgment level or change your character when you get confirmed to be secretary of defense,” Kaine said. “Instead, the things that have been part of your character just become much more dire and existential.”\n\n"}
{"title": "D-Day Veteran Charles Shay, Who Saved Lives on Omaha Beach, Dies at 101 in France", "publish_time": "20251203", "content": "PARIS (AP) — Charles Shay, a decorated Native American veteran who was a 19-year-old U.S. Army medic when he landed on Omaha Beach on D-Day and helped save lives, died on Wednesday. He was 101.\n\nShay died at his home in Bretteville-L'Orgueilleuse in France's Normandy region, his longtime friend and carer Marie-Pascale Legrand said.\n\nShay, of the Penobscot tribe and from Indian Island in the U.S. state of Maine, was awarded the Silver Star for repeatedly plunging into the sea and carrying critically wounded soldiers to relative safety, saving them from drowning. He also received France’s highest award, the Legion of Honor, in 2007.\n\nShay had been living in France since 2018, not far from the shores of Normandy where nearly 160,000 troops from Britain, the U.S., Canada and other nations landed on D-Day on June 6, 1944. The Battle of Normandy hastened Germany’s defeat, which came less than a year later.\n\n“He passed away peacefully surrounded by his loved ones,” Legrand told The Associated Press.\n\nThe Charles Shay Memorial group, which honors the memory of about 500 Native Americans who landed on the Normandy beaches, said in a statement posted on Facebook that “our hearts are deeply saddened as we share that our beloved Charles Norman Shay ... has returned home to the Creator and the Spirit World.”\n\n“He was an incredibly loving father, grandfather, father-in-law, and uncle, a hero to many, and an overall amazing human being,” the statement said. “Charles leaves a legacy of love, service, courage, spirit, duty and family that continues to shine brightly.”\n\nFor years, Shay performed a sage-burning ceremony, in homage to those who died, at a site overlooking Omaha Beach, where the monument bearing his name now stands. In 2022, he handed over the remembrance task to another Native American, Julia Kelly, a Gulf War veteran from the Crow tribe.\n\nOn D-Day, 4,414 Allied troops lost their lives, 2,501 of them Americans. More than 5,000 were wounded. On the German side, several thousand were killed or wounded.\n\n“I guess I was prepared to give my life if I had to. Fortunately, I did not have to,” Shay said in March 2024 in an interview with The Associated Press.\n\n“I had been given a job, and the way I looked at it, it was up to me to complete my job,” he recalled. “I did not have time to worry about my situation of being there and perhaps losing my life. There was no time for this.”\n\n"}
{"title": "Pentagon Watchdog Finds Hegseth’s Use of Signal Posed Risk to US Personnel", "publish_time": "20251203", "content": "WASHINGTON (AP) — The Pentagon’s watchdog found that Defense Secretary Pete Hegseth put U.S. personnel and their mission at risk when he used the Signal messaging app to convey sensitive information about a military strike against Houthi militants in Yemen, two people familiar with the findings said Wednesday.\n\nHegseth, however, has the ability to declassify material and the report did not find he did so improperly, according to one of the people familiar with the report's findings who spoke on condition of anonymity to discuss the information. CNN first reported the initial findings.\n\nThe review by the Pentagon inspector general’s office was delivered to lawmakers, who were able to review the report in a classified facility at the Capitol. A partially redacted version of the report was expected to be released publicly later this week.\n\nThe findings ramp up the pressure on the former Fox News Channel host after lawmakers had called for the independent inquiry into his use of the commercially available app. Lawmakers also just opened investigations into a news report that a follow-up strike on an alleged drug-smuggling boat in the Caribbean Ocean in September killed survivors following Hegseth issuing a verbal order to “kill everybody.\"\n\nIn at least two separate Signal chats, Hegseth provided the exact timings of warplane launches and when bombs would drop — before the men and women carrying out those attacks on behalf of the United States were airborne.\n\nHegseth’s use of the app came to light when a journalist, Jeffrey Goldberg of The Atlantic, was inadvertently added to a Signal text chain by then-national security adviser Mike Waltz. It included Vice President JD Vance, Secretary of State Marco Rubio, Director of National Intelligence Tulsi Gabbard and others, brought together to discuss March 15 military operations against the Iran-backed Houthis.\n\nHegseth had created another Signal chat with 13 people that included his wife and brother where he shared similar details of the same strike, The Associated Press reported.\n\n___\n\nAssociated Press writers Stephen Groves and Ben Finley contributed to this report.\n\n"}
{"title": "US to Restrict Visas of Nigerians Responsible for Violence Against Christians", "publish_time": "20251203", "content": "ABUJA, Nigeria (AP) — The United States will restrict visas for Nigerians and their family members responsible for mass killings and violence against Christians, the U.S. State Department said Wednesday.\n\n“The United States is taking decisive action in response to the mass killings and violence against Christians by radical Islamic terrorists, Fulani ethnic militias, and other violent actors in Nigeria and beyond,” Secretary of State Marco Rubio said in a statement posted on social platform X.\n\nThe secretary added that the policy would apply to other governments or individuals engaged in violations of religious freedom.\n\nThe restrictions are in line with a new policy under Section 212(a)(3)(C) of the Immigration and Nationality Act, he said.\n\nAttacks in Nigeria have varying motives. There are religiously motivated ones targeting both Christians and Muslims, clashes between farmers and herders over dwindling resources, communal rivalries, secessionist groups, and ethnic clashes.\n\nNigeria’s population of about 220 million people is split almost equally between Christians and Muslims.\n\nThe West African country has long faced insecurity from various fronts including the Boko Haram extremist group, which seeks to establish its radical interpretation of Islamic law and has also targeted Muslims it deems not Muslim enough.\n\nAlso, there has been an uptick in the activities of armed gangs in the central part of the country who kidnap locals for ransom.\n\nLast month, President Donald Trump said he has ordered the Pentagon to begin planning for potential military action in Nigeria following the claims of Christian persecution in Nigeria.\n\n"}
{"title": "Europeans Accuse Putin of Feigning Interest in Peace After Talks With US Envoys", "publish_time": "20251203", "content": "KYIV, Ukraine (AP) — Ukraine and its European allies accused Russian President Vladimir Putin on Wednesday of feigning interest in peace efforts after five hours of talks with U.S. envoys at the Kremlin produced no breakthrough.\n\nThe Russian leader “should end the bluster and the bloodshed and be ready to come to the table and to support a just and lasting peace,” said U.K. Foreign Secretary Yvette Cooper. Ukrainian Foreign Minister Andrii Sybiha urged Putin to “stop wasting the world’s time.”\n\nThe remarks reflect the high tensions and gaping gulf that remain between Russia on one side and Ukraine and its European allies on the other over how to end a war that Moscow started when it invaded its neighbor nearly four years ago.\n\nA day earlier, Putin accused the Europeans of sabotaging the U.S.-led peace efforts — and warned that, if provoked, Russia would be ready for war with Europe.\n\nSince Moscow invaded Ukraine in 2022, European governments, along with the U.S., have spent billions of dollars to support Kyiv financially and militarily. Under President Donald Trump, however, the U.S. has tempered its support — and instead made a push to end the war.\n\nOn Wednesday, the Kremlin spokesman said he wouldn't discuss the substance of the talks but pushed back on any suggestion that Putin had rejected the U.S. peace plan.\n\nWhere the peace talks go from here depends largely on whether the Trump administration decides to increase the pressure on Russia or on Ukraine to make concessions.\n\nA U.S. peace proposal that became public last month was criticized for being tilted heavily toward Moscow because it granted some of the Kremlin’s core demands that Kyiv has rejected as nonstarters.\n\nMany European leaders worry that if Russia gets what it wants in Ukraine, it will have free rein to threaten their countries, which already have faced incursions from Russian drones and fighter jets, and an alleged widespread sabotage campaign.\n\nPutin met Tuesday in Moscow with Trump’s envoy Steve Witkoff and son-in-law Jared Kushner. The Russian and American sides agreed not to disclose the substance of the talks, but at least one major hurdle to a settlement — the fate of four Ukrainian regions Russia partially seized and occupies and claims as its own — remains.\n\nAfter the talks, Yuri Ushakov, a senior adviser to Putin, told reporters that “so far, a compromise hasn’t been found” on the issue of territory, without which, he said, the Kremlin sees “no resolution to the crisis.”\n\nUkraine has ruled out giving up territory that Russia has captured.\n\nAsked whether peace was closer or further away after these talks, Ushakov said: “Not further, that’s for sure.”\n\n“But there’s still a lot of work to be done, both in Washington and in Moscow,” he said.\n\nKremlin spokesman Dmitry Peskov said Wednesday that it was “not correct” to say that Putin had rejected the U.S. peace plan. He declined to comment further on the talks.\n\n“We’re deliberately not going to add anything,” he said. “It’s understood that the quieter these negotiations are conducted, the more productive they will be.”\n\nForeign ministers from European NATO countries, meeting in Brussels on Wednesday, showed little patience with Moscow.\n\n“What we see is that Putin has not changed any course. He’s pushing more aggressively on the battlefield,” Estonian Foreign Minister Margus Tsahkna said. “It’s pretty obvious that he doesn’t want to have any kind of peace.”\n\nFinnish Foreign Minister Elina Valtonen struck the same note. “So far we haven’t seen any concessions from the side of the aggressor, which is Russia, and I think the best confidence-building measure would be to start with a full ceasefire,” she told reporters.\n\nNATO Secretary-General Mark Rutte said Ukraine’s partners will keep sending it military aid to ensure pressure is maintained on Moscow.\n\n“The peace talks are ongoing. That’s good,” Rutte said.\n\n“But at the same time, we have to make sure that whilst they take place and we are not sure when they will end, that Ukraine is in the strongest possible position to keep the fight going, to fight back against the Russians,” he said.\n\nCanada, Germany, Poland and the Netherlands announced that they will spend hundreds of millions of dollars more together to buy U.S. weapons to donate to Ukraine.\n\nThis year, European countries in NATO and Canada began buying American weapons for Ukraine under a financial arrangement known as the Prioritized Ukraine Requirements List, or PURL.\n\nRussia and Ukraine are engaged in a grim war of attrition on the battlefield and are using drones and missiles for long-range strikes behind the front line. Many analysts have noted that the slow slog favors Russia's larger military, especially if disagreements between Europe and the U.S. or among Europeans hampers the delivery of weapons to Ukraine.\n\nRussian drones hit the town of Ternivka in Ukraine’s Dnipropetrovsk region, killing two people and injuring three more, the head of the regional military administration, Vladyslav Haivanenko, said Wednesday.\n\nTwo people were in critical condition, he said, after the attack destroyed one house and damaged six more.\n\nOverall, Russia fired 111 strike and decoy drones at Ukraine overnight, Ukraine’s air force said.\n\nMeanwhile, Russia’s Ministry of Defense said Wednesday that air defenses destroyed 102 Ukrainian drones overnight.\n\nFalling drone debris sparked a fire at an oil depot in the Tambov region, about 200 kilometers (120 miles) south of Moscow, local Gov. Yegveniy Pervyshov said.\n\n___\n\nCook reported from Brussels.\n\n___\n\nFollow AP’s coverage of the war in Ukraine at https://apnews.com/hub/russia-ukraine\n\n"}
{"title": "Putin’s India Visit Tests New Delhi’s US–Russia Balancing Act", "publish_time": "20251203", "content": "President Vladimir Putin is set to visit India this week for the first time since Russia’s invasion of Ukraine, a rare trip that underscores the countries’ defense and energy ties as New Delhi seeks to finalize a trade deal with Washington.\n\nThe Russian leader is eager to show that Moscow still has strong relationships that matter beyond the West – and large markets it can trade with. For India, whose close economic and political ties with Russia date back to the Soviet period, the visit comes as sanctions and U.S. pressure curb an energy trade that has been expedient for its economy and vital for Russia. It is also an opportunity to demonstrate Prime Minister Narendra Modi’s continued ability to chart out an independent geopolitical path.\n\n“As the U.S. under Trump has become more isolationist and transactional, and relations with China remain poor, India is ensuring that its ties with middle powers like Russia — or Japan, UAE and the E.U. — are deepened,” said Pramit Pal Chaudhuri, head of Eurasia Group’s South Asia practice. “It helps India that President Trump has already ended Putin’s pariah status by holding his Alaska Summit.”\n\nBoth sides have formally framed the visit around trade, though deeper questions remain over energy and defense — two areas that have put India in the crosshairs of Trump. The U.S. leader has doubled India’s tariffs to 50% to punish the country for buying oil from Russia, and has pressured New Delhi to buy more American arms. Modi’s government is in talks with the Trump administration over trade and close to a deal — a goal that could prove more distant after a show of closer India-Russia ties.\n\nPutin’s visit comes against the backdrop of his talks on Tuesday with U.S. envoy Steve Witkoff and Jared Kushner, Trump’s son-in-law, on a new peace plan that Washington is pushing hard for Russia and Ukraine to accept. India has maintained a cautious position in relation to the war in Ukraine, calling for a halt to fighting, while also refusing to damage its relationship with Moscow. Modi hugged Putin and called him “my friend” in his first visit to Moscow in five years in 2024, just a day after a deadly Russian missile strike on the main children’s hospital in Kyiv provoked international outrage.\n\nThe European ambassadors of Germany, France and Britain in New Delhi wrote a joint op-ed in the Times of India on Monday, criticizing Russia’s war against Ukraine, and signaling — albeit indirectly — India’s long-held view that the conflict should be resolved through negotiations.\n\nOn the eve of his visit, Putin hailed his country’s ties with India and China, and pledged to boost relations to a “qualitatively new level.” He told a business forum in Moscow on Tuesday he’ll discuss trade with Modi, including “increasing the import of Indian goods into our market.”\n\nIndia is keen to discuss with Russia the purchase of Su-57 fighter jets and the advanced missile defense shield S-500. Russia remains its largest supplier of military hardware, even after a significant drop in purchases in the recent years, as New Delhi turns more frequently to the U.S. and European countries. The Modi government has indicated it will continue to take both U.S. and Russian equipment.\n\n“As self-sufficiency in defence production remains a distant goal, India will continue to rely on imports, and Russia remains its main supplier,” said Praveen Donthi, a senior analyst for India at International Crisis Group.\n\nIndia already has over 200 Russian fighter jets and several batteries of the earlier generation of air-defense systems, used during a four-day clash with Pakistan in May — a flare-up that has only added to New Delhi’s urgency. India’s military is also short on advanced aircraft.\n\nAny sale would have to overcome complications thrown up by sanctions and Russia’s own wartime demand.\n\nAnother major concern for the two leaders will be the oil trade, a key source of revenue for the Kremlin. India will seek to balance its need for inexpensive crude, given the weight of its import bill, with a desire to avoid punitive U.S. tariffs and sanctions.\n\nHistorically, it has not been a significant importer of Russian oil, depending more heavily on the Middle East. That changed in 2022, after the invasion of Ukraine and a price cap imposed by the Group of Seven nations that aimed to limit the Kremlin’s oil revenues. The surge in purchases — to the point where India became the largest buyer of seaborne Russian crude — was tacitly supported by a Biden administration eager to keep oil flowing, and prices down.\n\nTrump turned that into a pressure campaign this year, berating India and its refiners and eventually sanctioning Russia’s two largest oil producers, Rosneft PJSC and Lukoil PJSC, in an effort to push Putin to the negotiating table. That has dramatically reduced Russian shipments, even in the face of steep discounts – exporters are already offering the nation’s flagship Urals crude to India with a discount of as much as $7 a barrel to Brent benchmark on a delivered basis, for cargoes loading in December and arriving in January. That brings the price for India to the lowest in at least two years.\n\nThat’s a loss Putin will almost certainly seek to reverse. The delegation arriving on Thursday is expected to include senior oil industry executives, along with defense and other officials.\n\nBoth leaders will also use the visit to attempt to expand their trade beyond Russian oil and weapons, addressing a business forum on Friday to woo private companies.\n\nIndia is seeking to gain more access to the Russian market for its exporters hit by U.S. tariffs, with a likely agreement announced on the shipment of marine products and agricultural goods, an official from India’s Ministry of External Affairs told reporters in a background briefing on Tuesday. The two sides are also expected to agree on a pact to facilitate Indian workers traveling to Russia for jobs, the official said.\n\nRussia, meanwhile, locked out from markets like Europe, is also on the lookout for alternatives.\n\n“The idea is simple — to get more goods from India and pay for them with the rupees that Russia earns by selling India its oil,” said Tatiana Shaumyan, the head of the Center for Indian Studies at the Institute of Oriental Studies in Moscow.\n\nPutin and Modi are expected to discuss raising bilateral trade from the current $68 billion to $100 billion by 2030, and also improve systems to settle transactions in their own currencies, Kremlin spokesman Dmitry Peskov told local media Tuesday.\n\nFor India, breaking into the Russian market won’t be easy, though. Local and Chinese goods are widely available and competitively priced, leaving Indian exporters with a “quite small” list of viable products, said Alexey Kupriyanov, head of the Center of the Indo-Pacific Region at the state-run IMEMO institute in Moscow.\n\n--------\n\n—With assistance from Shruti Srivastava.\n\n___\n\n©2025 Bloomberg L.P. Visit bloomberg.com. Distributed by Tribune Content Agency, LLC.\n\n"}
{"title": "Hegseth Also Decried Unlawful Military Orders in Unearthed 2016 Speech", "publish_time": "20251203", "content": "Defense Secretary Pete Hegseth suggested military service members shouldn’t follow “unlawful orders” in a recently unearthed 2016 speech that closely mirrors the recent remarks by a group of Democratic lawmakers he has criticized as treasonous.\n\nPresident Trump’s Pentagon chief was captured on tape telling a conservative policy forum that the American military was better than others because service members are trained not to follow orders that violate the rules of war from the commander in chief or anyone else, a video published by CNN revealed.\n\n“If you’re doing something that is just completely unlawful and ruthless, then there is a consequence for that,” Hegseth said in the video. “That’s why the military said it won’t follow unlawful orders from their commander in chief.”\n\n“There’s a standard, there’s an ethos, there’s a belief that we are above what so many things that our enemies or others would do,” Hegseth added in the speech to the Liberty Forum of Silicon Valley, referring to the. U.S. military code of conduct.\n\nHegseth’s remarks, which the Pentagon defended as “uncontroversial,” echo the joint video posted on social media last month by Navy veteran and ex-astronaut Sen. Mark Kelly (D- Arizona) and five fellow Democratic lawmakers who are also military or national security agency veterans.\n\nKelly and the Democrats warned active duty service members that they should not follow unconstitutional edicts from Trump or others, saying “no one has to follow illegal orders.”\n\nTrump lashed out at the Democratic lawmakers, accusing them of treason and emphasizing that treason has historically been punishable by death. Hegseth accused them of “seditious” conduct.\n\nThe retired Navy pilot said Hegseth’s previous remarks were “the same as ours” and said Hegseth was only flip-flopping to curry favor with Trump.\n\n“We have an unqualified secretary of defense who only cares about sucking up to this president,” Kelly told CNN. “What we said was uncontroversial. The White House sort of confirmed that. They said, ‘his uncontroversial remarks.’ They were the same as ours.”\n\nNeither Kelly nor the other Democrats have said if they were referring to any particular orders or military operations that could be illegal.\n\nThe Trump administration has been hit with several lawsuits over its use of National Guard and active duty military to bolster his crackdown on undocumented immigrants on the streets of American cities.\n\nLawmakers from both parties have also raised major questions about the legality of Trump’s campaign of strikes on alleged drug boats in the Caribbean and eastern Pacific that has killed scores of people the Pentagon accuses of being drug traffickers.\n\nA Sept. 2 attack has raised special concern because reports say U.S. forces carried out a second attack that killed two people who survived an initial strike, an action that critics call a potential war crime.\n\nHegseth has sought to deflect questions about the “second tap” attack, defending the order for a follow-up strike but passing the buck to a top Navy admiral he says made the call. Lawmakers plan a probe of the controversial incident that could force Hegseth and other top brass to testify under oath.\n\n©2025 New York Daily News. Visit nydailynews.com. Distributed by Tribune Content Agency, LLC.\n\n"}
{"title": "Lawmakers to Hear from Navy Admiral Who Ordered Attack That Killed Boat Strike Survivors", "publish_time": "20251204", "content": "WASHINGTON — The Navy admiral who reportedly issued orders for the U.S. military to fire upon survivors of an attack on an alleged drug boat is expected Thursday on Capitol Hill to provide a classified briefing to top congressional lawmakers overseeing national security.\n\nThe information from Adm. Frank “Mitch” Bradley, who is now the commander of U.S. Special Operations Command, comes at a potentially crucial moment in the unfolding congressional investigation into how Defense Secretary Pete Hegseth handled the military operation in international waters near Venezuela. There are mounting questions over whether the strike may have violated the law.\n\nLawmakers are seeking a full accounting of the strikes after The Washington Post reported that Bradley on Sept. 2 ordered an attack on two survivors to comply with Hegseth's directive to “kill everybody.” Legal experts say the incident amounts to a crime if the survivors were targeted, and lawmakers on both sides of the aisle are demanding accountability.\n\nBradley will speak to a handful of top congressional leaders, including the Republican chairs and ranking Democrats of the House and Senate committees on Armed Services, and separately to the GOP chairman and Democratic vice chairman on the Senate Intelligence Committee.\n\n“This is an incredibly serious matter. This is about the safety of our troops. This is an incident that could expose members of our armed services to legal consequences,” Senate Democratic leader Chuck Schumer said in a floor speech Wednesday. “And yet the American public and the Congress are still not hearing basic facts.”\n\nAs Bradley appears for questions in the classified setting, lawmakers will be seeking answers to key questions: What orders did Hegseth give regarding the operations? And what was the reasoning for the second strike?\n\nDemocratic lawmakers are also demanding that the Trump administration release the full video of the Sept. 2 attack, as well as written records of the orders and any directives from Hegseth. While Republicans, who control the national security committees, have not publicly called for those documents, they have pledged a thorough review.\n\n“The investigation is going to be done by the numbers,” said Sen. Roger Wicker, the chair of the Senate Armed Services Committee. “We’ll find out the ground truth.”\n\nPresident Donald Trump has stood behind Hegseth as he defends his handling of the attack, but pressure is mounting on the defense secretary.\n\nHegseth has said the aftermath of an initial strike on the boat was clouded in the “fog of war.” He has also said he “didn’t stick around” for the second strike, but said Bradley “made the right call” and “had complete authority” to do it.\n\nAlso on Thursday, the Defense Department inspector general was expected to release a partially redacted report into Hegseth's use of the Signal messaging app in March to share information about a military strike against Yemen’s Houthi militants.\n\nThe report found that Hegseth put U.S. personnel and their mission at risk by using Signal, according to two people familiar with the findings. The Pentagon, however, has cast the report as an exoneration of Hegseth.\n\nAt the time of the attack, Bradley was the commander of Joint Special Operations Command, overseeing coordinated operations between the military's elite special operations units out of Fort Bragg in North Carolina. About a month after the strike, he was promoted to commander of U.S. Special Operations Command.\n\nHis military career, spanning over three decades, was mostly spent serving in the elite Navy SEALs and commanding joint operations. He was among the first special forces officers to deploy to Afghanistan after the 9/11 attacks. His latest promotion to admiral was approved by unanimous voice vote in the Senate earlier this year, and Democratic and Republican senators praised his record.\n\n“I’m expecting Bradley to tell the truth and shed some light on what actually happened,” said Virginia Sen. Mark Warner, the ranking Democrat on the Senate Intelligence Committee, adding that he had “great respect for his record.”\n\nSen. Thom Tillis, a North Carolina Republican, described Bradley as among those who are “rock solid” and “the most extraordinary people that have ever served in the military.”\n\nBut lawmakers like Tillis have also made it clear they expect a reckoning if it is found that survivors were targeted. “Anybody in the chain of command that was responsible for it, that had vision of it, needs to be held accountable,” he said.\n\nThe scope of the investigation is not yet clear, but there is other documentation of the strike that could fill in what happened. But obtaining that information will largely depend on action from Republican lawmakers — a potentially painful prospect for them if it puts them at odds with the president.\n\nSen. Jack Reed, the top Democrat on the Armed Services committee, said he and Wicker have formally requested the executive orders authorizing the operations and the complete videos from the strikes. They are also seeking the intelligence that identified the vessels as legitimate targets, the rules of engagement for the attacks and any criteria used to determine who was a combatant and who was a civilian.\n\nMilitary officials were aware that there were survivors in the water after the initial strike but carried out the follow-on strike under the rationale that it needed to sink the vessel, according to two people familiar with the matter who spoke on the condition of anonymity. What remains unclear — and what lawmakers hope to clarify in their briefing with Bradley — was who ordered the strikes and whether Hegseth was involved, one of the people said.\n\nRepublican lawmakers who are close to Trump have sought to defend Hegseth this week, standing behind the military campaign against drug cartels that the president deems “narco-terrorists.”\n\n“I see nothing wrong with what took place,” said Sen. Markwayne Mullin, an Oklahoma Republican, as he argued that the Trump administration was justified in using war powers against drug cartels.\n\nMore than 80 people have been killed in the series of strikes that started in September. And for critics of the campaign like Sen. Richard Blumenthal, D-Conn., the pressing questions about the legality of killing survivors are a natural outgrowth of military action that was always on shaky legal ground. He said it was clear that Hegseth is responsible, even if he didn't explicitly order a second attack.\n\n“He may not have been in the room, but he was in the loop,” Blumenthal said. “And it was his order that was instrumental and foreseeably resulted in the deaths of these survivors.”\n\n"}
{"title": "Trump Says National Guard Will Be Sent to New Orleans", "publish_time": "20251203", "content": "NEW ORLEANS — President Donald Trump said Tuesday that National Guard troops will soon head to New Orleans and bring another federal surge to the city that is already awaiting a separate immigration crackdown dubbed “Swamp Sweep” that is expected to begin this week.\n\nTrump did not say how many troops would be sent to New Orleans or exactly when they would arrive. Republican Louisiana Gov. Jeff Landry, who asked the Trump administration in September for up to 1,000 troops to fight crime, told reporters Monday that he expected the Guard to arrive in New Orleans before Christmas.\n\n“Gov. Landry — a great guy, a great governor — he’s asked for help in New Orleans. And we’re going to go there in a couple of weeks,” Trump said during a Cabinet meeting at the White House.\n\nLandry, a staunch Trump ally, has said he welcomes federal intervention in Democratic-run New Orleans, citing concerns about elevated violent crime rates even though local police officials say crime is down. Separately, Landry posted on social media this week that “We Welcome the Swamp Sweep in Louisiana,\" referring to the Border Patrol-led operation that aims to arrest 5,000 people over the coming weeks.\n\nOpponents argue that deployment of federal troops or agents in Louisiana is unwarranted, especially as some cities have actually seen a decrease in violent crime rates — namely New Orleans, which is on pace to have one of its safest years, statistically, since the 1970s.\n\nIn September, Landry requested federally funded National Guard troops be sent to Louisiana. In a letter to Defense Secretary Pete Hegseth, Landry said there have been “elevated violent crime rates” in New Orleans, Baton Rouge and Shreveport along with shortages in law enforcement personnel.\n\nLandry also said the state’s vulnerability to natural disasters makes the issue more challenging, and the extra support would be especially helpful for major events, including Mardi Gras and college football bowl games.\n\nLouisiana National Guard spokesperson Lt. Col. Noel Collins declined to comment Tuesday.\n\nIn 2022, New Orleans had the dubious distinction of being considered the “murder capital of the country,” reporting the highest per-capita homicide rate in the nation. That year there were 266 murders — a rate of 70 per 100,000 inhabitants.\n\nThree years later, however, shootings, carjackings and armed robberies have plummeted. While there has been a spike of homicides in recent weeks, the city is still on pace to have its lowest number in nearly 50 years, according to crime data from the police department. As of early November, the New Orleans Police Department reported 97 murders.\n\nMayor-elect Helena Moreno, a Democrat who takes office in January, has firmly rejected the idea of a National Guard deployment in the blue city and has expressed concern that a federal immigration enforcement surge will lead to rights violations. She did not provide comment on the impending deployment.\n\nOutgoing Mayor LaToya Cantrell, a Democrat facing federal corruption charges, previously said the city was open to working with the federal government to improve public safety.\n\nA spokesperson for Cantrell, Terry Davis, told The Associated Press in a written statement that the city and its police “have a track record of working collaboratively” with the National Guard and state and federal law enforcement agencies.\n\nOther New Orleans officials have warned that troops could disrupt unique cultural traditions, such as the frequent brass band parades in the streets that are known as second lines or jeopardize hard-won relationships between communities and the police.\n\nU.S. Rep. Troy Carter, a Louisiana Democrat who represents New Orleans, had a strong reaction to news of another deployment of a federal agency to his hometown: “New Orleans welcomes partnership. We do not welcome occupation,” he said in a press release Tuesday evening.\n\nCarter went on to describe the deployment as a “political stunt” that causes “chaos” and lacks transparency and “meaningful coordination” with local officials.\n\n“These are militarized forces who are not trained in our local laws, not trained in community-based de-escalation, and do not know our neighborhoods or our people,” he said. “That is a recipe for fear, confusion, and dangerous mistakes.”\n\nIn January, 100 guard members were sent to the city to help with security measures following a New Year's Day truck attack that killed 14 people and injured dozens of other revelers on Bourbon Street.\n\nIn September, Landry also suggested that federally funded National Guard troops should be sent to Baton Rouge and Shreveport, and Monday indicated troops would be sent to cities beyond New Orleans.\n\nIn Baton Rouge, the capital, Republican Mayor Sid Edwards said this month that extra assets could provide “much-needed boots on the ground” amid a police shortage.\n\nAlthough homicides are on pace to decrease from the previous year there as well, the city has struggled with gun violence, with bystanders caught in crossfire made worse by the use of machine gun conversion devices. A recent multiagency initiative to crack down on violent crime resulted in more than 100 arrests and the seizure of guns.\n\nIn conservative Shreveport, the hometown of U.S. House Speaker Mike Johnson, Republican Mayor Tom Arceneaux told the AP in October that violent crime has significantly decreased. Arceneaux said he was willing to work with the National Guard but would prefer receiving state police officers instead.\n\nLouisiana is the latest place where Trump has sent — or tried to send — National Guard troops in recent months. Other cities include Los Angeles, Baltimore, Washington and Memphis, Tennessee. Leaders in Democratic-controlled jurisdictions have turned to legal action to block planned deployments, such as in Chicago and Portland, Oregon.\n\n___\n\nCline reported from Baton Rouge, Louisiana. Associated Press writer Michelle Price contributed reporting from Washington, D.C.\n\n"}
{"title": "Hegseth Cites ‘Fog of War’ in Defending Follow-on Strike in Scrutinized Attack on Alleged Drug Boat", "publish_time": "20251202", "content": "WASHINGTON (AP) — Defense Secretary Pete Hegseth cited the “fog of war” in defending a follow-up strike on an alleged drug-carrying boat in the Caribbean Sea earlier this year.\n\nDuring Tuesday’s cabinet meeting at the White House, Hegseth said that he did not see that there were survivors in the water when the second strike was ordered and launched in early September, saying that “the thing was on fire” and citing the “fog of war” in defending the strike. Hegseth also said he “didn’t stick around” for the remainder of the mission following the first strike, and said that the admiral in charge had “made the right call” in ordering it, which he “had complete authority to do.”\n\nThe Washington Post first reported that Hegseth issued a verbal order for the second strike that killed survivors on the boat. On Monday, the White House said that Navy Vice Adm. Frank “Mitch” Bradley acted “within his authority and the law” when he ordered the second strike.\n\nLawmakers have announced congressional reviews of the U.S. military strikes against vessels suspected of smuggling drugs, and Bradley is expected to provide a classified briefing Thursday to lawmakers overseeing the military. Asked if he supported the second strike on a boat in the Caribbean Sea in September, President Donald Trump said he “didn’t know anything” and “still haven’t gotten a lot of information because I rely on Pete,” referencing Hegseth.\n\n"}
{"title": "US Envoy Witkoff Will Meet Putin in Moscow While Zelenskyy Tours Europe as Peace Efforts Press Ahead", "publish_time": "20251202", "content": "U.S. special envoy Steve Witkoff was due to meet with Russian President Vladimir Putin in Moscow on Tuesday, taking to the Kremlin an embryonic peace plan that Washington hopes can bring about an end to the nearly four-year war in Ukraine.\n\nCoinciding with Witkoff’s trip, Ukrainian President Volodymyr Zelenskyy went to Ireland, continuing his visits to European countries that have helped sustain his country’s fight against Russia’s invasion.\n\nAfter months of frustration in his efforts to stop the fighting, U.S. President Donald Trump is deploying officials to get traction for his peace proposals. Jared Kushner, Trump’s son-in-law, will join the meeting between Putin and Witkoff, Kremlin spokesman Dmitry Peskov told reporters. He said that the talks would take “as long as needed” and will involve only Witkoff, Kushner and an interpreter from the U.S. side.\n\nSo far, the talks have followed parallel lines, with U.S. Secretary of State Marco Rubio sitting down with Ukrainian officials, and now Witkoff heading to Moscow.\n\nZelenskyy said that he met Tuesday with the Ukrainian delegation that returned from the latest round of negotiations with the U.S. representatives in Florida. Rubio said that those talks made progress, but added that “there’s more work to be done.”\n\nZelenskyy said that the Florida talks took as their cue a document that both sides drafted at an earlier meeting in Geneva. The Ukrainian leader said that document was now “finalized,” although he didn’t explain what that meant.\n\nUkrainian diplomats are working to ensure that European partners are “substantially involved” in decision-making, Zelenskyy said on the Telegram messaging app, and warned about what he said were Russian disinformation campaigns aimed at steering the negotiations.\n\n“Ukrainian intelligence will provide partners with the information we have about Russia’s true intentions and its attempts to use diplomatic efforts as cover to ease sanctions and block important collective European decisions,” Zelenskyy said.\n\nZelenskyy was meeting with political leaders and lawmakers in Dublin on his first official visit. Ireland is officially neutral and isn't a member of NATO, but has sent nonlethal military support to Ukraine. More than 100,000 Ukrainians have moved to Ireland since Russia launched its war on Feb. 24, 2022.\n\nThough this week’s consultations could move the process forward, few details have become public. It remains unclear how envoys are going to bridge the gap between the two sides on such basic differences as who keeps what territory. European officials say the road to peace will be long.\n\nEuropean leaders, who fear Russia’s future territorial ambitions and are trying to figure out how they can fund Ukraine’s fight beyond this year, are trying to make their voices heard after being largely sidelined by Washington. They are also working on future security guarantees for Ukraine.\n\nFrench President Emmanuel Macron said Monday that he and Zelenskyy, who was on a trip to Paris, spoke by phone with Witkoff. They also spoke to leaders of eight other European countries as well as top European Union officials and NATO Secretary-General Mark Rutte.\n\nMacron said that the coming days will see “crucial discussions” between U.S. officials and Western partners. Zelenskyy’s visit to Paris followed Sunday’s meeting between Ukrainian and U.S. officials, which Rubio described as productive.\n\nDiplomats face a hard time trying to bridge Russian and Ukrainian differences and persuading them to strike compromises. The key obstacles — over whether Kyiv should cede land to Moscow and how to ensure Ukraine’s future security — appear unresolved.\n\nZelenskyy is under severe pressure in one of the darkest periods of the war for his country. As well as managing diplomatic pressure, he must find money to keep Ukraine afloat, address a corruption scandal that has reached the top echelons of his government, and keep Russia at bay on the battlefield.\n\nThe Kremlin late Monday claimed that Russian forces have captured the key Ukrainian city of Pokrovsk in the eastern Donetsk region. Zelenskyy, however, said in Paris that fighting was still ongoing in Pokrovsk on Monday.\n\n___\n\nFollow AP’s coverage of the war in Ukraine at https://apnews.com/hub/russia-ukraine\n\n"}
{"title": "NATO Chief Dismisses Concerns About US Commitment to the Alliance Ahead of Ukraine Meeting", "publish_time": "20251202", "content": "BRUSSELS (AP) — NATO Secretary-General Mark Rutte brushed off fresh concern Tuesday about the United States’ commitment to the military organization on the eve of a meeting of allied foreign ministers focused on Russia’s war against Ukraine.\n\nU.S. Secretary of State Marco Rubio will not attend Wednesday's meeting, which will unfold during high-stakes negotiations in Moscow and elsewhere in Europe on Ukraine’s future. His rare absence at the U.S.-led alliance comes after President Donald Trump’s 28-point proposal to end the almost four-year war dismayed European allies and Canada last month.\n\nThe administration's draft plan suggested that NATO would not expand further — a longtime Russian demand — and that Ukraine would not be admitted, breaking with a yearslong promise to Kyiv that it has a place at the organization’s table.\n\nThe plan also stated that a dialogue would be held between Russia and NATO, mediated by the U.S., to resolve all security issues and create business opportunities. It was unclear how NATO’s most influential member might serve as an impartial mediator.\n\nSpeaking to reporters ahead of the meeting, Rutte underlined that Rubio has a busy schedule.\n\n“He’s working extremely hard to take care not only of the situation of Ukraine, but of course many other issues which are on his plate,” Rutte said. “So I totally accept him not being able to be here tomorrow, and I would not read anything in it.”\n\nA senior State Department official, speaking on condition of anonymity to discuss the internal administration reasoning for the absence, said Rubio has already attended dozens of meetings with NATO allies, \"and it would be completely impractical to expect him at every meeting.”\n\nDeputy Secretary of State Christopher Landau will attend instead and press the allies to deliver on their commitment to invest 5% of gross domestic product on defense.\n\nRutte also downplayed contentious parts of Trump’s original plan for ending the war, saying that it has been heavily reworked to address European concerns.\n\n“You need to start somewhere. You need to have proposals on the table,” he said.\n\nHe added: “When it comes to the NATO elements of a deal to end the war against Ukraine, that will be dealt with separately. And that obviously will include NATO.\"\n\nDespite the proposal to rule out Ukrainian membership, the former Dutch prime minister insisted that the country remains on an “irreversible path” to join the world’s biggest security organization, as NATO leaders pledged in Washington in 2024.\n\nBut he underlined that it’s politically impossible for Ukraine to become a member, which would require the unanimous agreement of all 32 allies. The Trump administration has ruled that out, and Hungary and Slovakia are also opposed.\n\n“Right now, as you know, there is no consensus on Ukraine joining NATO,” Rutte said.\n\nAt NATO’s last summit in The Hague, Trump reassured European partners when he affirmed the U.S. commitment to Article 5 — the collective security guarantee that says an attack on any ally should be considered an attack on all of them.\n\nHe described the other NATO leaders as a “nice group of people” and said that “almost every one of them said ‘Thank God for the United States.’” But several of his remarks since then seem to place the United States outside the organization it has long led.\n\n“We’re selling a lot of weapons to NATO, and that’s going I guess to Ukraine for the most part,” Trump said at a White House meeting with Finnish President Alexander Stubb in October. “That’s up to them, but they’re buying weapons from the U.S.”\n\nConcerns are also high about a further U.S. troop drawdown in Europe. Romania announced in October that the United States would reduce its military presence in the country by up to 3,000 troops as it focuses on security threats in Asia and elsewhere.\n\nThe administration is expected to announce its troop movement plans in early 2026.\n\n"}
{"title": "Plea Deal With Son of Drug Kingpin ‘El Chapo’ Details Abduction of Legendary Sinaloa Capo", "publish_time": "20251202", "content": "MEXICO CITY (AP) — Armed men entered through a window to ambush Ismael “El Mayo” Zambada, the most elusive of the Sinaloa cartel’s leaders, who was then loaded onto a plane, drugged and spirited across the border to the United States, according to details revealed Monday in the plea hearing of the drug trafficker who abducted him.\n\nJoaquín Guzmán López, the 39-year-old son of former Sinaloa cartel kingpin Joaquín “El Chapo” Guzmán, pleaded guilty to two counts of drug trafficking and continuing criminal enterprise in federal court in Chicago after admitting his role in overseeing the transport of tens of thousands of kilograms (pounds) of drugs to the U.S.\n\nAs part of that plea agreement, U.S. prosecutors shared what had been one of the central questions in the hours and days immediately after Zambada fell into U.S. hands in July 2024.\n\nHow did the wily drug capo who had stayed ahead of authorities for decades end up in the United States like a present tied with bow?\n\nThe plea agreement did not name Zambada, but in the days after his arrest, one of his lawyers shared a letter from him that explained he had been called to a meeting with Guzmán López and there he had been abducted.\n\nAndrew Erskine, an attorney representing the U.S. government, said Monday the alleged kidnapping of an unnamed individual was part of an attempt to show cooperation with Washington, which he said did not sanction those actions. He also said Guzmán López would not receive cooperation credit because of that.\n\nThe arrest of both drug traffickers by U.S. authorities angered Mexico's then-President Andrés Manuel López Obrador, who suspected the U.S. government was behind the operation. Washington denied involvement from the outset, but experts thought it would be virtually impossible to pull off without U.S. authorities having some knowledge.\n\nErskine described the alleged kidnapping in court, saying Guzmán López had the glass from a floor-to-ceiling window removed from a room ahead of the meeting with the unnamed person.\n\nGuzmán López allegedly had others enter through the open window, seize the individual, put a bag over his head and take him to a plane. On board, he was zip tied and given sedatives before the plane landed at a New Mexico airport near the border with Texas.\n\nZambada in his letter said Guzmán López had called him to a meeting on the outskirts of Sinaloa state’s capital, Culiacan, along with some local politicians, one of whom was later found dead.\n\nHe said when he arrived there were a lot of armed men in green military uniforms, who he assumed were gunmen for the “Chapitos,” as “El Chapo” Guzmán’s sons were known. Even though they ran a rival faction within the cartel, Zambada maintained communication with them and appeared to trust Guzmán López enough to follow him into a dark room.\n\nOn the plane that landed in New Mexico were only the pilot, Zambada and Guzmán López. Aboard the plane, Zambada was given a drink containing sedatives, which Guzmán López also drank a little of, according to Guzmán López’s account.\n\nRather than congratulating or thanking the U.S. for arresting the elusive Zambada, Mexico’s Attorney General’s Office said it was studying the possibility of bringing treason charges against Guzmán López or whoever else aided in the plot.\n\nThe arrests set off a bloody fight in Sinaloa among their respective cartel factions for control of the business, violence that López Obrador’s successor President Claudia Sheinbaum is still dealing with.\n\nWith the plea deal, Guzmán López’s defense attorney, Jeffrey Lichtman, said he is expected to avoid life in prison.\n\nJoaquín “El Chapo” Guzmán is serving a life sentence after being convicted in 2019 for his role as the former leader of the Sinaloa cartel, having smuggled mountains of cocaine and other drugs into the United States over 25 years.\n\n___\n\nFernando reported from Chicago.\n\n"}
{"title": "Shooting of National Guard Members Prompts Flurry of US Immigration Restrictions", "publish_time": "20251202", "content": "WASHINGTON — Since last week's shooting of two National Guard members in the nation’s capital by a suspect who is an Afghan national, the Trump administration announced a flurry of policies aimed at making it harder for some foreigners to enter or stay in the country.\n\nThe administration said it was pausing asylum decisions, reexamining green card applications for people from countries \"of concern” and halting visas for Afghans who assisted the U.S. war effort.\n\nDays before the shooting, a memo obtained by The Associated Press said the administration would review the cases of all refugees who entered the U.S. during the Biden administration.\n\nThe stepped up effort to restrict immigration has been harshly criticized by refugee advocates and those who work with Afghans, saying it amounts to collective punishment. Critics are also saying it is a waste of government resources to reopen cases that have already been processed.\n\nThe Trump administration says the new policies are necessary to ensure that those entering the country — or are already here — do not pose a security threat.\n\nHere's a look at the major changes announced over roughly a week:\n\nThe director of U.S. Citizenship and Immigration Services, Joseph Edlow, said on the social platform X last week that asylum decisions will be paused “until we can ensure that every alien is vetted and screened to the maximum degree possible.”\n\nBesides the post, no formal guidance has been put forward, so details remain scarce about the planned pause.\n\nPeople seeking asylum must show to U.S. officials a threat of persecution if they were sent back to their home country, whether because of race, nationality or other grounds. If they're granted asylum, they're allowed to stay in the U.S. and eventually apply for a green card and then citizenship.\n\nThe Afghan suspect in the National Guard shooting was granted asylum earlier this year, according to advocate group #AfghanEvac.\n\nThe right to apply for asylum was already restricted by the Trump administration. In January, President Donald Trump issued an executive order essentially halting asylum for people who have come into the country through the southern border. Those cases generally go through immigration courts which are overseen by the Justice Department.\n\nUSCIS oversees the asylum process for foreigners the government isn't trying to remove via immigration courts. While Trump's January order didn't affect those cases, Edlow's social media post suggests they will now come under additional scrutiny. Edlow did not say how long the agency's pause on asylum decisions would last or what happens to people while those decisions are paused.\n\nCaseloads have been rising for all types of asylum applications. USCIS said there are currently 1.4 million pending asylum cases at the agency. Just a few years ago, in 2022, it was 241,280, according to the Office of Homeland Security Statistics. Separately there are about 2.4 million pending asylum applications in front of the Justice Department's immigration courts.\n\nOn Nov. 27, Edlow said his agency was conducting a “full scale, rigorous reexamination” of every green card for people he said come from “every country of concern.”\n\n“American safety is non negotiable,” Edlow said.\n\nThe agency said in a press release that same day that it was issuing new guidance that could make it tougher for people from 19 countries the administration considers “high-risk,” including Afghanistan, when they apply for immigration benefits such as applying for green cards or to stay in the U.S. longer.\n\nThe administration had already banned travel to the U.S. for citizens from 12 of those countries and restricted access for people from seven others.\n\nOther stricter stricter measures are also directed at Afghans.\n\nOn Nov. 26, USCIS said it would be suspending all “immigration requests relating to Afghan nationals.” That would affect Afghans already living in the U.S. who are applying for green cards or work permits or permission to bring family members to the U.S.\n\nSeparately, Secretary of State Marco Rubio announced late Friday on X that the State Department has temporarily stopped issuing visas for all people traveling on Afghan passports.\n\nThe Trump administration had already severely limited travel and immigration from Afghanistan. The one avenue that had remained open was the Special Immigrant Visa program. Created by Congress, it allowed Afghans who closely supported the U.S. war effort in Afghanistan and faced retribution because of their work to emigrate to America.\n\nBut the State Department’s announcement means even that avenue is now closed.\n\nAccording to #AfghanEvac, a group that advocates for Afghans coming to the U.S., about 180,000 Afghans were in the process of applying for the SIV program.\n\nEven before the shooting of two National Guard members, the Trump administration was planning a sweeping review of tens of thousands of immigrants who entered the U.S. during the Biden administration as part of the U.S. Refugee Assistance Program.\n\nThat program, first launched in 1980, oversees the process by which people fleeing persecution can come to the U.S. Refugees are distinct from people seeking asylum, although they meet the same criteria. Refugees have to apply and wait outside the U.S. to be admitted while asylum-seekers do so once they reach the U.S.\n\nTrump suspended the refugee program the day he took office and only a trickle of refugees have been admitted since then, either white South Africans or people admitted as part of a lawsuit seeking to restart the refugee program.\n\nThen on Nov. 21, Edlow said in a memo obtained by The Associated Press that the administration was going to review all refugees admitted to the U.S. during the Biden administration. That's nearly 200,000 refugees.\n\nAdvocates say refugees already undergo rigorous vetting.\n\nLate Monday, Homeland Security Secretary Kristi Noem suggested in a post on X that more changes could be in the offing.\n\nNoting that she had just met with Trump, Noem said she was recommending a “full travel ban” on countries she said were flooding the U.S. “with killers, leeches, and entitlement junkies.”\n\nNoem did not specifically name any countries and no timeline was given. The Department of Homeland Security said in an email Monday, “We will be announcing the list soon.”\n\n"}
{"title": "Special Representative Named for US Backed-Gang Suppression Force in Haiti", "publish_time": "20251202", "content": "A longtime United Nations expert on peace building who has worked in some of the world’s most complex security environments, has been named the special representative for the newly authorized, but not yet fully deployed, Gang Suppression Force in Haiti.\n\nJack Christofides was named by the group of countries tasked with overseeing the U.S.-backed force. Known as the Standing Group of Partners, they include the United States, Canada, El Salvador, Guatemala, Jamaica, The Bahamas and Kenya, which is led by Force Commander Godfrey Otunge.\n\nIn a release, Otunge said Christofides, who has worked throughout the U.N. peacekeeping system, “brings experience in political affairs, peace-building and operational leadership, which will be instrumental in guiding the GSF’s efforts to address Haiti’s security crisis and lay the groundwork for sustainable peace.”\n\nMost recently, Christofides served as director of the Departments of Political and Peacebuilding Affairs and Peace Operations, Northern Africa Division, in New York. From 2020 to 2023, he was deputy head of mission and director of political & civil affairs for the U.N. Interim Force in Lebanon (UNIFIL), where he played a key role in advancing stability and political dialogue in a challenging context.\n\nHis previous roles include director of the Africa II Division in the Department of Peacekeeping Operations, and director of Policy, Evaluation, and Training in the Departments of Peacekeeping Operations and Field Support.\n\nThe GSF’s mission is to restore state authority and public order, reduce gang territorial control, secure critical infrastructure, and support the Haitian people as they work toward a return to elected governance and long-term stability.\n\nIn late September, the U.N. Security Council authorized the deployment of the new international force to replace the struggling Kenya-led Multinational Security Support mission, to restore state authority and public order, reduce gang territorial control, secure critical infrastructure, and support the Haitian people as they work toward a return to elected governance and long-term stability. But months after the vote, there remains a lack of clarity over its funding, full deployment or where the envisioned 5,500 mostly military personnel will come from.\n\nA pledging conference, organized by the U.S. and hosted by Canada, is schedule to take place in New York in the coming days with a new Haiti Support Office to help finance the logistics of the force not scheduled to be operational until the Spring.\n\nMeanwhile, countries are engaged in ongoing negotiations over the force’s concept of operations, which has triggered concerns over the military focused of the force given the large number of children and youth who make up Haitian gangs.\n\nBoth in international circles and in Haiti, some are insisting that the focus on the new force can’t solely be about killing gang members. The GSF’s mission also needs to ensure a localized strategy for non-military actions so that real peace building can finally happen in Haiti, some are insisting.\n\nStill, it remains to be seen as the force’s concept of operations remains a point of contention among perspective partners, and Washington pushes for elections in an environment where over 1.4 million remain internally displaced and gangs reach into rural communities are growing seemingly every day.\n\nOver the weekend, armed gangs attacked Pont-Sondé, a rural town in central Haiti in the Lower Artibonite, forcing thousands to flee burning homes. At least 10 people are confirmed dead, local authorities said, cautioning that the situation remains volatile, and they cannot yet say definitely say what the toll is.\n\nThe attacks are prompting frustrations with community leaders, who say they’ve pleaded for drones and other reinforcements to no available, leaving them vulnerable to the Gran Grif gang’s continued attacks.\n\nIn addition to Pont-Sondé, gangs are also entrenched on the outskirts of Arcahaie the town where Haiti’s flag was founded, the town’s mayor Wilner Rene said Tuesday during an interview on Port-au-Prince based Magik 9 radio station.\n\n“It’s a situation that’s been developing for the last 15 days,” he said, detailing how the farming community is currently surrounded by allies of the Viv Ansanm gang coalition that now controls Mountrouis, once home to the Caribbean’s first Club Med and luxury beachfront homes of the country’s wealthy, to the north of Arcahaie and Cabaret to its south.\n\n“The gangs have burned homes, killed people,” he said, confirming reports that gangs recently set fire to a truck carrying fuel in the town of Bercy, located between the Arcahaie and Cabaret off the National Road #1 that connects the capital to the north. Among the dead was a specialized agent with the Haiti National Police.\n\nThough the Haiti National Police and self-defense brigades remain on alert, they lack the ability to give an effective response. If they had the means, he said, “the gangs would have already been pushed back.”\n\n“We are launching an SOS to the police and the central authorities to take their responsibility and unblock National Road #1,” he said, “because this allows these guys in Cabaret to always threaten the people of Arcahaie. Dislodge them.”\n\n©2025 Miami Herald. Visit miamiherald.com. Distributed by Tribune Content Agency, LLC.\n\n"}
{"title": "Man Charged in National Guard Shooting Pleads Not Guilty During Court Appearance From Hospital Bed", "publish_time": "20251202", "content": "WASHINGTON (AP) — A man accused of shooting two National Guard troops near the White House pleaded not guilty on Tuesday to murder and assault charges during his first appearance before a judge via video from a hospital bed.\n\nRahmanullah Lakanwal, a 29-year-old Afghan national who was also shot, faces charges stemming from the Nov. 26 shooting that killed Specialist Sarah Beckstrom, 20, and wounded Staff Sgt. Andrew Wolfe, 24. His attorney entered a not guilty plea on his behalf during a brief court hearing in Washington, D.C.\n\nBeckstrom and Wolfe were deployed with the West Virginia National Guard for President Donald Trump’s law-enforcement surge in the nation’s capital, which has flooded the city with federal agents and troops since August.\n\nAuthorities were investigating a possible motive for what they described as an ambush-style attack.\n\nA prosecutor, Ariel Dean, described the shooting as a “shocking crime” and said it appears that Lakanwal “traversed the city to some extent” before approaching the troops and shooting them.\n\nThe magistrate judge ordered him detained, citing the “sheer terror that resulted” from Lakanwal’s actions.\n\nThe rare shooting of National Guard members on American soil came amid court fights and a broader public policy debate about the Trump administration’s use of the military to combat what officials cast as an out-of-control crime problem.\n\nLakanwal entered the U.S. in 2021 through Operation Allies Welcome, a Biden administration program that resettled Afghans after the U.S. withdrawal from the country, officials said. Lakanwal applied for asylum during the Biden administration, but his asylum was approved under the Trump administration, #AfghanEvac said in a statement.\n\nTrump called the shooting a “terrorist attack” and criticized the Biden administration for enabling Afghans who worked with U.S. forces during the Afghanistan War to enter the U.S. The president has said he wants to “permanently pause migration” from poorer nations and expel millions of immigrants from the country.\n\n"}
{"title": "Lawmakers Voice Support for Congressional Reviews of Trump’s Military Strikes on Boats", "publish_time": "20251201", "content": "WASHINGTON (AP) — Lawmakers from both parties said Sunday they support congressional reviews of U.S. military strikes against vessels suspected of smuggling drugs in the Caribbean Sea and eastern Pacific Ocean, citing a published report that Defense Secretary Pete Hegseth issued a verbal order for all crew members to be killed as part of a Sept. 2 attack.\n\nThe lawmakers said they did not know whether last week's Washington Post report was true, and some Republicans were skeptical, but they said attacking survivors of an initial missile strike poses serious legal concerns.\n\n“This rises to the level of a war crime if it's true,” said Sen. Tim Kaine, D-Va.\n\nRep. Mike Turner, R-Ohio, when asked about a follow-up strike aimed at people no longer able to fight, said Congress does not have information that happened. He noted that leaders of the Armed Services Committee in both the House and Senate have opened investigations.\n\n“Obviously, if that occurred, that would be very serious and I agree that that would be an illegal act,” Turner said.\n\nMeanwhile, President Donald Trump on Sunday evening while flying back to Washington from Florida, where he celebrated Thanksgiving, confirmed that he had recently spoken with Venezuelan President Nicolás Maduro.\n\nThe U.S. administration says the strikes in the Caribbean are aimed at cartels, some of which it claims are controlled by Maduro. Trump also is weighing whether to carry out strikes on the Venezuelan mainland.\n\nTrump declined to comment on details of the call, which was first reported by The New York Times.\n\n“I wouldn’t say it went well or badly,” Trump told reporters aboard Air Force One, when asked about the call.\n\nThe Venezuelan communications ministry did not immediately respond to a request for comment about the call with Trump.\n\nTurner said there are concerns in Congress about the attacks on vessels that the Trump administration says are transporting drugs, but the allegation regarding the Sept. 2 attack “is completely outside anything that has been discussed with Congress and there is an ongoing investigation.”\n\nThe comments from lawmakers during news show appearances come as the administration escalates a campaign to combat drug trafficking into the U.S. On Saturday, Trump said the airspace “above and surrounding” Venezuela should be considered as “closed in its entirety,” an assertion that raised more questions about the U.S. pressure on Maduro. Maduro's government accused Trump of making a ”colonial threat” and seeking to undermine the South American country’s sovereignty.\n\nAfter the Post's report, Hegseth said Friday on X that “fake news is delivering more fabricated, inflammatory, and derogatory reporting to discredit our incredible warriors fighting to protect the homeland.”\n\n\"Our current operations in the Caribbean are lawful under both U.S. and international law, with all actions in compliance with the law of armed conflict—and approved by the best military and civilian lawyers, up and down the chain of command,\" Hegseth wrote.\n\nTrump said on Sunday the administration “will look into” the matter but added, “I wouldn’t have wanted that — not a second strike.” The president also defended Hegseth.\n\n“Pete said he did not order the death of those two men,” Trump said. He added, “And I believe him.”\n\nRepublican Sen. Roger Wicker of Mississippi, chairman of the Senate Armed Services Committee, and its top Democrat, Rhode Island Sen. Jack Reed, said in a joint statement late Friday that the committee “will be conducting vigorous oversight to determine the facts related to these circumstances.”\n\nThat was followed Saturday with the chairman of the House Armed Services Committee, Republican Rep. Mike Rogers of Alabama, and the ranking Democratic member, Washington Rep. Adam Smith, issuing a joint statement saying the panel was committed to “providing rigorous oversight of the Department of Defense’s military operations in the Caribbean.”\n\n“We take seriously the reports of follow-on strikes on boats alleged to be ferrying narcotics in the SOUTHCOM region and are taking bipartisan action to gather a full accounting of the operation in question,” Rogers and Smith said, referring to U.S. Southern Command.\n\nRep. Don Bacon, R-Neb., asked about the Sept. 2 attack, said Hegseth deserves a chance to present his side.\n\n“We should get to the truth. I don’t think he would be foolish enough to make this decision to say, kill everybody, kill the survivors because that’s a clear violation of the law of war,” Bacon said. “So, I’m very suspicious that he would’ve done something like that because it would go against common sense.”\n\nKaine and Turner appeared on CBS' “Face the Nation,\" and Bacon was on ABC's “This Week.\"\n\n"}
{"title": "Civilian Office, Military Obligations: What the Kelly Investigation Reveals", "publish_time": "20251125", "content": "Senator Mark Kelly sits at an unusual point where civilian office and military law intersect. His appearance in a recent video urging U.S. service members to refuse “illegal orders” prompted the Department of Defense to open a formal review. The Pentagon relies on statutory authority allowing certain retired officers to remain subject to the Uniform Code of Military Justice and to be recalled for potential discipline under 10 U.S.C. § 688. The review places Kelly in a rare position for a sitting senator and raises questions about how far military obligations extend once a service member steps into elected office. Coverage of the announcement emphasizes the core issue is the point where political speech meets the command structures that maintain discipline in the armed forces.\n\nThe video featured six lawmakers with either military or intelligence backgrounds addressing U.S. service members. Kelly’s comments included the phrase that troops “can refuse illegal orders.” According to reporting from Politico, the Pentagon viewed the message as potentially harmful to “loyalty, morale, or good order and discipline.” Although five other lawmakers appeared in the video, Kelly stands alone as the subject of the review because the Department of Defense determined he remains under UCMJ jurisdiction as a retired Navy captain. The other lawmakers either never retired from service or come from intelligence agencies outside the UCMJ’s reach. That distinction shapes the Pentagon’s current treatment of the matter.\n\nThe Department of Defense justified its review by pointing to its recall authority over retired officers, which appears in 10 U.S.C. § 688, and to several UCMJ provisions that apply to retirees on the rolls. The Pentagon reminded service members the UCMJ presumes orders to be lawful unless they are clearly illegal, such as commands that require a criminal act. It also referenced federal statutes prohibiting attempts to interfere with the discipline of the armed forces. Kelly’s use of his military rank in the video appears to be a key factor in the Pentagon’s belief his conduct may fall within the scope of UCMJ review.\n\nAlthough the video showcased six participants, only Kelly currently faces military legal exposure. The Pentagon has stated that he is the only one whom the UCMJ still governs due to his retirement status. Other lawmakers in the video either served in the military without retiring or came from non-military national security roles, such as the Central Intelligence Agency. That jurisdictional point drives the Department of Defense’s current stance and explains why Kelly occupies a unique position in this unfolding story. The Pentagon has not publicly indicated any comparable review of the other five video participants.\n\nThis case sits at the intersection of civilian democracy and military command structures. Kelly maintains that his message simply reminded troops of their legal obligations, as he explained in follow-up remarks reported by The Guardian. The Pentagon, however, views the video differently and frames it as a possible threat to discipline and hierarchy. That tension highlights the longstanding challenge in American civil-military relations: how to balance the constitutional right of elected officials to speak with the military’s need for a stable and lawful chain of command. The situation also creates a rarely tested legal question about whether military authority can reach into the legislative branch when the individual in question retains retired-officer status.\n\nThe Constitution assigns Congress the power to regulate the armed forces while vesting command authority in the President. When a member of Congress remains subject to recall for potential military discipline, the separation between the branches becomes less clear. Reporting notes legal scholars consider this scenario extremely rare, with few modern precedents. That rarity underscores the unsettled legal landscape around military authority over retirees who hold high civilian office.\n\nThe Kelly investigation invites a deeper conversation about the boundary between military service and civilian governance. If the Pentagon pursues the review further, it could set a precedent for how the Department of Defense handles retired officers who transition into national leadership roles and then speak publicly on military matters. If the review ends quietly, the case may nonetheless shape how current and former service members approach public communication, especially during periods of political tension.\n\nAs the Department of Defense continues its assessment, observers will watch closely to see whether this situation becomes a one-off episode or the start of a broader debate over military obligations that continue after uniformed service ends. The answer will influence how the United States interprets the responsibilities of those who once served and now hold civilian power, and how the armed forces maintain discipline without overreaching into political life.\n\n"}
{"title": "Experts Doubt the Pentagon Can Punish Kelly Over the 'Illegal Orders' Video", "publish_time": "20251129", "content": "WASHINGTON (AP) — The Pentagon’s investigation of Sen. Mark Kelly over a video that urges American troops to defy “illegal orders” has raised a slew of questions, and some criticism, from legal experts.\n\nSome say the Pentagon is misreading military law to go after Kelly as a retired Navy fighter pilot. Others say the Arizona Democrat cannot be prosecuted as a member of Congress. A group of former military prosecutors insists he did nothing wrong.\n\nThe Pentagon announced the investigation last week after President Donald Trump’s social media post accusing Kelly — and the five other Democratic lawmakers in the video — of sedition “punishable by DEATH.”\n\nDefense Secretary Pete Hegseth said Kelly was facing investigation because he is the only one in that group who formally retired from the military and is still under the Pentagon’s jurisdiction.\n\nKelly dismissed the inquiry as the work of “bullies” and said it would not deter him and other members of Congress “from doing our jobs and holding this administration accountable.”\n\n‘It’s not totally unheard of’\n\nStephen Vladeck, a Georgetown University law professor, said there has been a “significant uptick” in courts-martial of retired service members in the past decade. While courts have debated the constitutionality, the practice is currently allowed. He said there have been roughly a dozen such prosecutions across the service branches.\n\nThere are roughly 2 million people who formally retired from the military and receive retirement pay, according to a report from the Congressional Research Service. Service members are generally entitled to retirement pay after completing 20 years of active duty.\n\nTodd Huntley, a retired Navy captain and judge advocate general, or JAG, said it is rare to prosecute retirees for something that happened after they retired.\n\n“It’s not totally unheard of,” said Huntley, who now directs Georgetown’s national security law program. “I actually prosecuted a enlisted guy who had been retired for 16 years. He was essentially assaulting his adopted daughter. Basically no one else had jurisdiction so we prosecuted him.”\n\nA ‘ridiculous conclusion’\n\nColby Vokey, a prominent civilian military lawyer and former military prosecutor, said Hegseth appears to be misreading the Uniform Code of Military Justice to justify the Kelly investigation.\n\nVokey said Hegseth has personal jurisdiction over Kelly because Kelly is entitled to retirement pay. But Vokey said Hegseth lacks subject matter jurisdiction because Kelly made his statements as a senator.\n\nVokey said case law has evolved to where the military can prosecute an active-duty service member for a crime committed off base, such as robbing a convenience store. But applying military law to a retired service member and “assuming that means every offense ever is kind of a ridiculous conclusion.”\n\n“Let’s say you have a 100-year-old World War II veteran who is retired with pay and he steals a candy bar,” Vokey said. “Hegseth could bring him back and court-martial him. And that in effect is what is happening with Kelly.”\n\nPatrick McLain, a retired Marine Corps judge and former federal prosecutor, said the cases he has seen of retirees being called back “are more like extreme examples of fraud or some of these child pornography cases.”\n\n“I’ve not seen anything like the kind of the wackadoodle thing they’re trying to do to Sen. Kelly for essentially exercising his First Amendment right to free speech, which they don’t like,” McLain said.\n\n‘He did it as a civilian’\n\nCharles Dunlap, a Duke University law professor and retired Air Force lawyer, said in an email that military law can restrict speech for service members that is protected for civilians under the First Amendment.\n\nBut even if the video was found to have violated military law, a key issue may be whether the law can be applied to someone who is retired, Dunlap said.\n\nA group of former military lawyers, the Former JAGs Working Group, said in a statement that Kelly did not violate the Uniform Code of Military Justice.\n\n“The video simply described the law as it pertains to lawful versus unlawful orders,” the group said. “It did not suborn mutiny or otherwise encourage military members to disregard or disobey lawful orders issued to them.”\n\nTroops, especially uniformed commanders, have specific obligations to reject orders that are unlawful. Broad legal precedence also holds that just following orders — colloquially known as the “Nuremberg defense,” as it was used unsuccessfully by senior Nazi officials to justify their actions under Adolf Hitler — does not absolve troops.\n\nKelly and the other lawmakers did not mention specific circumstances in the video. Some Democratic lawmakers have questioned the legality of the Trump administration’s attempts to send National Guard troops into U.S. cities. Kelly has pointedly questioned the use of the military to attack alleged drug boats off South America’s coast, saying he was worried about the military officers involved with the mission and whether they were following orders that may have been illegal.\n\nMichael O’Hanlon, director of research in the foreign policy program at the Brookings Institution, said any case brought against Kelly likely would be thrown out or end in an acquittal.\n\nO’Hanlon said it might not have been politically smart to “wave a red flag in front of the bull” but he does not see the legal grounds for a court martial.\n\n“Saying that you shouldn’t break the law cannot be a crime,” O’Hanlon said. “But in addition, he did not do it as a military officer. He did it as a civilian.”\n\nSeparation of powers\n\nKelly’s status as a senator could block the Pentagon’s investigation because of constitutional protections for the separation of powers in the U.S government.\n\nThe Constitution explicitly shields members of Congress from White House overreach, said Anthony Michael Kreis, a constitutional law professor at Georgia State University.\n\n“Having a United States senator subject to discipline at the behest of the secretary of defense and the president — that violates a core principle of legislative independence,” Kreis said in a telephone interview.\n\nKreis said such protections were a reaction to the British monarchy, which arbitrarily punished members of Parliament.\n\n”Any way you cut it, the Constitution is fundamentally structurally designed to prevent this kind of abuse,” Kreis said.\n\n"}
{"title": "Speaker Mike Johnson Working Behind Scenes to Slash IVF Provision From NDAA", "publish_time": "20251204", "content": "House Speaker Mike Johnson of Louisiana is allegedly working behind the scenes to get rid of a provision mandating health care coverage for assisted reproductive technology, including in vitro fertilization (IVF), for all active-duty service members from the National Defense Authorization Act (NDAA).\n\nThat is according to U.S. Sen. Tammy Duckworth (D-IL), who told Military.com that Johnson is targeting TRICARE—the insurance plan for service members and their families outside of military facilities that covers IVF for everyone regardless of health situations. MS Now first reported the story.\n\nIf the provision is stripped from the final version of the NDAA, it would prevent the expansion of IVF access to all servicemembers. Current insurance plans through TRICARE only cover fertility services for service members whose infertility was caused by “a serious or severe illness or injury while on active duty.”\n\nDuckworth, a disabled U.S. Army veteran who struggled with infertility for a decade before she used IVF to conceive her daughters, wrote in a post on X that Johnson’s alleged intentions equate to “single-handedly trying to kill” the provision that both the House and Senate previously supported in negotiations.\n\n“This is yet another excuse from Speaker Mike Johnson in a pathetic attempt to carry out his extreme, right-wing belief that considers hopeful parents who depend on IVF—and their doctors—as murderers,” Duckworth told Military.com. “His views are completely out of touch with the vast majority of Americans who support access to IVF, including his own president.\n\n“He needs to stop getting between [President Donald] Trump and his promise to the American people, fall in line, and help ensure our heroes get the same access to IVF coverage as members of Congress already receive. Anything less is hypocrisy at its worst.”\n\n“This is yet another excuse from Speaker Mike Johnson in a pathetic attempt to carry out his extreme, right-wing belief that considers hopeful parents who depend on IVF—and their doctors—as murderers.\"\n\nA spokesperson for Johnson told MS Now that he, the GOP are working to expand IVF and that “the Speaker has clearly and repeatedly stated he is supportive of access to IVF when sufficient pro-life protections are in place, and he will continue to be supportive when it is done responsibly and ethically.\"\n\nMilitary.com reached out to Johnson’s office for comment.\n\nDanielle Melfi, CEO of RESOLVE: The National Infertility Association, told Military.com that \"removing the IVF coverage provision from the NDAA would deny coverage to the very families who have sacrificed so much for our country.\n\n\"Stripping this language, which had bipartisan support, would once again leave servicemembers without the same care that members of Congress and their staff have,\" Melfi said. \"Moreover, this action would run counter to President Trump’s public commitment to expand access to IVF.\n\n“Americans overwhelmingly support access to IVF. Standing with our troops means ensuring they have the full range of medical care needed to build their families. We urge Speaker Johnson and congressional leadership to keep this provision and align the NDAA with the values of the American people and the administration.”\n\nSpeaker Johnson has been asked about IVF before, including in March 2024 after Alabama Republican Gov. Kay Ivey signed legislation protecting IVF providers from legal liability. The issue caused consternation before and after the fact considering that Alabama’s Supreme Court said in a prior ruling that embryos could be considered children under state law.\n\nJohnson told CBS Mornings at the time that Alabama “has done a good job” of grappling with the issue.\n\n\"We need to look at the ethics surrounding that issue, but it's an important one,\" Johnson said. \"If you do believe that life begins at conception, it's a really important question to wrestle with.\"\n\nThe pro-life advocate mentioned his position in support of the \"sanctity of life\" as well as IVF, adding that states must consider the \"ethical handling\" of IVF.\n\n\"In some states, like in Louisiana, there's a limit on the number of embryos that can be created because they're sensitive to that issue,\" he added.\n\nJulie Eshelman, founder, CEO and president of the Building Military Families Network told Military.com that she worries Johnson will strip the provision based on his personal beliefs rather than those of his constituency.\n\n\"The president and the American people support expanding insurance coverage for fertility treatments like IVF,\" Eshelman said. \"If the Speaker wants to act in the best interests of our military and honor the commitment of making IVF more accessible, this NDAA provision is a great place to start.\n\n\"Military families experience infertility at more than four times the rate of the civilian population, and the top barrier to building their families is the out-of-pocket costs. We should be thanking our military service members and their families by providing them the best healthcare options, the disease of infertility included. At the very least our military should be receiving the same healthcare benefits that members of Congress have.\"\n\nThe claimed impending stripping down of the TRICARE provision would be antithetical to what President Trump campaigned on leading up to the 2024 election.\n\nAs recently as October, the president announced his intent to further lower costs and expand access to IVF when he said EMD Serono, one of the world’s leading manufacturers of fertility medications, had reached an agreement with the White House to provide “massive cost savings on fertility treatments” for all Americans.\n\nThe agreement includes EMD Serono, for the first time, investing in related manufacturing within the United States. The announcement made no direct mention to IVF and its fiscal ties to the U.S. military and/or its active-duty members.\n\nA Biden-era Defense Department policy in March 2024 expanded TRICARE eligibility for infertility treatments to unmarried service members and those needing donated eggs or sperm, adding onto a previous policy when the DoD only offered such treatments to certain married service members.\n\nEggs or sperm donated by a third party were also prohibited by DoD at that juncture, effectively barring same-sex couples from the benefit.\n\n“Trump touted himself as the Father of IVF both on the campaign trail and in office,” Duckworth told MS Now. “Time and time again, as recently as October, he’s promised that he would cover IVF for American families — but apparently not military families.”\n\nMilitary.com reached out to the White House for comment.\n\nThe National Health Study for a New Generation of U.S. Veterans, a 2014 study of 60,000 Operation Enduring Freedom (OEF), Operation Iraqi Freedom (OIF), and OEF/OIF-era veterans, is one of the largest scientific research studies of this group of veterans and included input from roughly 20,500 veterans. Data remains featured on the Department of Veterans Affairs website.\n\nIt found that of those veterans who served during those periods, 15.8% of women and 13.8% of men reported that they had experienced infertility—defined as attempts with a partner to get pregnant for more than 12 months.\n\n\"If the IVF provision is left out of the NDAA for the second year in a row, we can expect more military families to speak up and express their frustrations with the lack of coverage for IVF,\" Eshelman said. \"This is a retention issue. It impacts readiness and it creates unnecessary financial and emotional stress on a community that is already managing so much because of military life.\"\n\nWhile assessing rates of comparison between the general population and military service members is acknowledged within the study as a difficult task due to the intricacies associated with infertility, they did note that female veterans were more likely to seek care for infertility than male veterans.\n\nAlso, approximately 40% of men and women Veterans with a history of infertility reported that they or their partner sought infertility treatment.\n\n“Attacking active servicemembers’ access to IVF and fertility treatments is a new and cowardly low, even for Speaker Johnson,” Amy Williams Navarro, director of government relations for Reproductive Freedom for All, said in a statement. “It’s a cruel irony that Johnson, who has always publicly claimed to support and protect servicemembers, is now working behind the scenes to take IVF coverage away from the people who bravely serve our country.”\n\nUPDATED 12/4/25, 2:21 p.m. ET: This story was updated with remarks from Julie Eshelman.\n\n"}
{"title": "Report Says World's Biggest Arms Producers Increased Revenue by 5.9% Last Year to Record Level", "publish_time": "20251201", "content": "STOCKHOLM — The world's biggest weapons-producing companies saw a 5.9% increase in revenue from sales of arms and military services last year as demand was fed by the wars in Ukraine and Gaza as well as countries' rising military spending, according to a report released Monday.\n\nThe Stockholm International Peace Research Institute, or SIPRI, said the revenues of the 100 largest arms makers grew to $679 billion in 2024, the highest figure it has recorded.\n\nThe bulk of the increase was down to companies based in Europe and the United States, but there were increases around the world — except in Asia and Oceania, where problems in the Chinese arms industry led to a slight fall.\n\nThirty of the 39 U.S. companies in the top 100 — including Lockheed Martin, Northrop Grumman and General Dynamics — posted increases. Their combined revenue was up 3.8% at $334 billion. But SIPRI noted that “widespread delays and budget overruns continue to plague development and production” in major U.S.-led programs, including the F-35 fighter jet.\n\nTwenty-three of the 26 companies in Europe, excluding Russia, saw their arms revenue increase as the continent boosted spending. Their aggregate income rose by 13% to $151 billion, fueled by demand linked to the war in Ukraine and the perceived threat from Russia.\n\nThere were notably big gains for the Czech Republic's Czechoslovak Group, whose revenue soared by 193% thanks in part to a government-led project to source artillery shells for Ukraine; and for Ukraine's JSC Ukrainian Defense Industry, which had a 41% gain.\n\nEuropean firms are investing in new production capacity to meet greater demand, but SIPRI researcher Jade Guiberteau Ricard cautioned in a statement that “sourcing materials could pose a growing challenge,” with restructuring of supply chains for critical minerals a potential complication in light of Chinese export restrictions.\n\nThe two Russian companies in SIPRI's list, Rostec and United Shipbuilding Corporation, saw arms revenues rise 23% to a combined $31.2 billion, despite sanctions leading to a shortage of components. SIPRI said that domestic demand was more than enough to offset falling arms exports, though a skilled labor shortage is a challenge.\n\nArms revenue also grew in the Middle East, and the three Israeli companies in the ranking had a 16% increase to $16.2 billion. In 2024, the backlash over Israeli actions in Gaza \"seems to have had little impact on interest in Israeli weapons,’ SIPRI researcher Zubaida Karim said, and many countries continued to place new orders.\n\nA 1.2% drop in revenue in Asia and Oceania to $130 billion was led by a 10% drop in the income of the eight Chinese companies in the index. That came as multiple corruption allegations in Chinese arms procurement led to major contracts being delayed or canceled last year, SIPRI said.\n\n"}
{"title": "An Archaeologist is Racing to Preserve Sudan's Heritage as War Threatens to Erase its Cultural Past", "publish_time": "20251130", "content": "PARIS (AP) — In a dimly lit office in a corner of the French National Institute for Art History, Sudanese archaeologist Shadia Abdrabo studies a photograph of pottery made in her country around 7,000 B.C. She carefully types a description of the Neolithic artifact into a spreadsheet.\n\nAs the war between the Rapid Support Forces (RSF) and the Sudanese Armed Forces (SAF) rages on, the curator from Sudan’s National Corporation for Antiquities and Museums (NCAM) is on a yearlong research grant in France with one mission: to build an online database of the African nation’s archaeological sites, museum collections and historical archives.\n\nSoon after the war in Sudan started, in April 2023, museums were looted and destroyed. It’s unclear what exactly went missing, but Abdrabo says her task is to find out — and time is of the essence.\n\n“We have to work fast to secure our collections. We’ve already lost two museums and we don’t want to lose more,” Abdrabo told The Associated Press.\n\nShe says two regional museums in El Geneina and Nyala were almost completely destroyed, while in Khartoum, the National Museum — which held an estimated 100,000 objects before the war — was ransacked by militias who posted videos online of their fighters inside the storeroom.\n\nThe National Museum had pieces dating back to prehistoric times, including from the Kerma Kingdom and the Napatan era when Kushite kings ruled the region as well as from the Meroitic civilization that built Sudan’s pyramids. Other galleries displayed later Christian and Islamic objects.\n\nAmong its most valuable items were mummies dating back to 2,500 B.C., some of the oldest and most archaeologically significant in the world as well as royal Kushite treasures.\n\nUNESCO raised the alarm on reports of plundering saying the “threat to culture appears to have reached an unprecedented level.”\n\n“My heart was broken, you know? It’s not just objects that we lost. We lost research, we lost studies, we lost many things,” Abdrabo said.\n\nLast month, hundreds of people were left dead and more than 80,000 others forced into displacement after the capture of North Darfur’s capital, El Fasher, by the RSF. For Abdrabo the work is deeply personal.\n\n“I’m from Nubia, from the north, an area filled with monuments, archaeological sites and ancient life,” she said. The region was home to some of the world’s earliest kingdoms that rivaled ancient Egypt in power and wealth.\n\nShe was working at the national museum in the capital Khartoum when the war started.\n\n“We thought it would finish soon … but then life started getting really difficult: not just the bombing, but there was no electricity, no water,” she said. With her three sisters, she fled north — first to Atbara, then to Abri, and eventually to Port Sudan.\n\nDuring that time, Abdrabo and her NCAM colleagues worked tirelessly to try and protect Sudan’s 11 museums and sites — some designated with UNESCO World Heritage status — moving pieces to safe rooms and secret locations.\n\nBut efforts to protect Sudan’s art were too slow, said Ali Nour, a Sudanese cultural heritage advocate.\n\n“While applications were being drafted, sites were being emptied. While risk assessments were reviewed, entire archives vanished,” Nour wrote in an article for the U.K.-based International Institute for Conservation of Historic and Artistic Works.\n\nUNESCO said it carried out inventories, trained police and customs officers to recognize stolen antiquities, while appealing to collectors “to refrain from acquiring or taking part in the import, export or transfer of ownership of cultural property from Sudan.”\n\nBut, unlike similar cultural emergencies that followed wars in Afghanistan and Iraq, \"Sudan has not benefited from strong media coverage denouncing the degradation and plundering of its cultural heritage,'' according to researcher Meryam Amarir. ‘’This lack of visibility has reduced the international response.”\n\nAncient Sudan was connected, through trade and military activity, with Egypt, the Mediterranean world and Mesopotamia, and was the source of much of the gold available in the region, according to Geoff Emberling of the Kelsey Museum of Archaeology at the University of Michigan.\n\n“If we’re interested in these ancient cultures, then we have to be interested in Sudan,” said Emberling, who is involved with the recently established Sudan Cultural Emergency Recovery Fund.\n\nThe task force, requested by NCAM, aims to unite institutions, scholars, and donors around the urgent recovery efforts of Sudan’s heritage.\n\n“What Shadia Abdrabo is doing is urgently essential — establishing what’s missing,” Emberling told the AP. “And with a team of about 15 Sudanese now working in the museum in Khartoum to clean and restore what has been damaged, they will soon be able to compare what remains there now.”\n\nAbdrabo has funding until April 2026 to finish compiling the data and building a platform, but she worries it won’t be enough time.\n\nThe work is painstaking. Some datasets arrive as spreadsheets, others as handwritten inventories or photographs taken decades ago. Colleagues at the Louvre, the British Museum and others lend support but she works mostly alone.\n\n“I’m trying to finish this database but it’s a lot. I’ve done about 20% of the work. Just for the national museums, I’ve recorded 1,080 objects so far … and then I have to do other museums, sites, archives… I need to add pictures, ID numbers, coordinates …”\n\nAs the winter settles over Paris, the crisis in Sudan drives Abdrabo.\n\n“We are working on tracking what has been looted,” she said. “I cry when I talk about this. My only goal and message is to bring back as much as possible, to do as much as I can for Sudan, but it’s not easy for us.”\n\nIt’s not just the war itself, but the consequences of it that could affect the country’s heritage: “militias, people displaced… it’s not safe for the art to be in unsecure locations,” she added.\n\n“Until the war finishes we just don’t know what is going to happen.”\n\n"}
